<div style="border: 1px solid black">
<b><center><font size="4">Data Science</font></center></b>

<b><center><font size="3">Manipulação e Análise de Dados com Pandas Dataframes</font></center></b>

<b><center><font size="2">5 - Data Wrangling</font></center></b>
</div>

**Notebook Developed by**: [Ricardo Campos](https://www.di.ubi.pt/~rcampos)<br>
**email:**  ricardo.campos@ubi.pt<br>
**Affiliation:** *Assistant Professor* @ [University of Beira Interior](http://www.ubi.pt);
*Researcher* @ [LIAAD](https://www.inesctec.pt/en/centres/liaad)-[INESC TEC](https://www.inesctec.pt/en)

<hr>

<p><a href="5DataWrangling.ipynb" title="Download Notebook" download><img src="https://www.di.ubi.pt/~rcampos/assets/img_tutorials/download.jpg" align = "left" width="50" height="50" alt="Download Notebook"></a></p>
<p>&nbsp;</p>
<p>&nbsp;</p>

<hr>

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Step-1:-Data-Cleaning" data-toc-modified-id="Step-1:-Data-Cleaning-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Step 1: Data Cleaning</a></span><ul class="toc-item"><li><span><a href="#Missing-Data-(NaN)" data-toc-modified-id="Missing-Data-(NaN)-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Missing Data (NaN)</a></span><ul class="toc-item"><li><span><a href="#Checking-for-Missing-Data" data-toc-modified-id="Checking-for-Missing-Data-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Checking for Missing Data</a></span></li><li><span><a href="#replace" data-toc-modified-id="replace-1.1.2"><span class="toc-item-num">1.1.2&nbsp;&nbsp;</span>replace</a></span></li><li><span><a href="#Deletion-(DropNa)" data-toc-modified-id="Deletion-(DropNa)-1.1.3"><span class="toc-item-num">1.1.3&nbsp;&nbsp;</span>Deletion (DropNa)</a></span></li><li><span><a href="#Imputation-(FillNa)" data-toc-modified-id="Imputation-(FillNa)-1.1.4"><span class="toc-item-num">1.1.4&nbsp;&nbsp;</span>Imputation (FillNa)</a></span><ul class="toc-item"><li><span><a href="#Mean" data-toc-modified-id="Mean-1.1.4.1"><span class="toc-item-num">1.1.4.1&nbsp;&nbsp;</span>Mean</a></span></li><li><span><a href="#Mode" data-toc-modified-id="Mode-1.1.4.2"><span class="toc-item-num">1.1.4.2&nbsp;&nbsp;</span>Mode</a></span></li><li><span><a href="#Determining-different-values-to-give-to-fillna" data-toc-modified-id="Determining-different-values-to-give-to-fillna-1.1.4.3"><span class="toc-item-num">1.1.4.3&nbsp;&nbsp;</span>Determining different values to give to fillna</a></span></li><li><span><a href="#bfill" data-toc-modified-id="bfill-1.1.4.4"><span class="toc-item-num">1.1.4.4&nbsp;&nbsp;</span>bfill</a></span></li><li><span><a href="#ffill" data-toc-modified-id="ffill-1.1.4.5"><span class="toc-item-num">1.1.4.5&nbsp;&nbsp;</span>ffill</a></span></li><li><span><a href="#Default-Value" data-toc-modified-id="Default-Value-1.1.4.6"><span class="toc-item-num">1.1.4.6&nbsp;&nbsp;</span>Default Value</a></span></li></ul></li></ul></li><li><span><a href="#Duplicates" data-toc-modified-id="Duplicates-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Duplicates</a></span><ul class="toc-item"><li><span><a href="#Identify" data-toc-modified-id="Identify-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>Identify</a></span></li><li><span><a href="#Drop" data-toc-modified-id="Drop-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Drop</a></span></li></ul></li></ul></li><li><span><a href="#Step-2:-Data-Transformation" data-toc-modified-id="Step-2:-Data-Transformation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Step 2: Data Transformation</a></span><ul class="toc-item"><li><span><a href="#Change-Data-Types" data-toc-modified-id="Change-Data-Types-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Change Data Types</a></span><ul class="toc-item"><li><span><a href="#dates" data-toc-modified-id="dates-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>dates</a></span></li><li><span><a href="#int-(astype)" data-toc-modified-id="int-(astype)-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>int (astype)</a></span></li><li><span><a href="#float-(astype)" data-toc-modified-id="float-(astype)-2.1.3"><span class="toc-item-num">2.1.3&nbsp;&nbsp;</span>float (astype)</a></span></li><li><span><a href="#category-(astype)" data-toc-modified-id="category-(astype)-2.1.4"><span class="toc-item-num">2.1.4&nbsp;&nbsp;</span>category (astype)</a></span></li><li><span><a href="#str" data-toc-modified-id="str-2.1.5"><span class="toc-item-num">2.1.5&nbsp;&nbsp;</span>str</a></span></li></ul></li><li><span><a href="#ConvertDF2Numpy" data-toc-modified-id="ConvertDF2Numpy-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>ConvertDF2Numpy</a></span></li><li><span><a href="#Add-New-Data" data-toc-modified-id="Add-New-Data-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Add New Data</a></span><ul class="toc-item"><li><span><a href="#Columns" data-toc-modified-id="Columns-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Columns</a></span><ul class="toc-item"><li><span><a href="#Add" data-toc-modified-id="Add-2.3.1.1"><span class="toc-item-num">2.3.1.1&nbsp;&nbsp;</span>Add</a></span><ul class="toc-item"><li><span><a href="#Lambda-Function" data-toc-modified-id="Lambda-Function-2.3.1.1.1"><span class="toc-item-num">2.3.1.1.1&nbsp;&nbsp;</span>Lambda Function</a></span></li><li><span><a href="#Custom-Function" data-toc-modified-id="Custom-Function-2.3.1.1.2"><span class="toc-item-num">2.3.1.1.2&nbsp;&nbsp;</span>Custom Function</a></span></li></ul></li><li><span><a href="#Replace-Column-Names" data-toc-modified-id="Replace-Column-Names-2.3.1.2"><span class="toc-item-num">2.3.1.2&nbsp;&nbsp;</span>Replace Column Names</a></span></li></ul></li><li><span><a href="#Rows" data-toc-modified-id="Rows-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>Rows</a></span></li><li><span><a href="#Vectorization" data-toc-modified-id="Vectorization-2.3.3"><span class="toc-item-num">2.3.3&nbsp;&nbsp;</span>Vectorization</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-2.3.3.1"><span class="toc-item-num">2.3.3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Numpy" data-toc-modified-id="Numpy-2.3.3.2"><span class="toc-item-num">2.3.3.2&nbsp;&nbsp;</span>Numpy</a></span><ul class="toc-item"><li><span><a href="#Numpy-Functions" data-toc-modified-id="Numpy-Functions-2.3.3.2.1"><span class="toc-item-num">2.3.3.2.1&nbsp;&nbsp;</span>Numpy Functions</a></span></li><li><span><a href="#numpy-where" data-toc-modified-id="numpy-where-2.3.3.2.2"><span class="toc-item-num">2.3.3.2.2&nbsp;&nbsp;</span>numpy where</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Normalization" data-toc-modified-id="Normalization-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Normalization</a></span><ul class="toc-item"><li><span><a href="#MinMaxScaler" data-toc-modified-id="MinMaxScaler-2.4.1"><span class="toc-item-num">2.4.1&nbsp;&nbsp;</span>MinMaxScaler</a></span></li><li><span><a href="#StandardScaler" data-toc-modified-id="StandardScaler-2.4.2"><span class="toc-item-num">2.4.2&nbsp;&nbsp;</span>StandardScaler</a></span></li></ul></li><li><span><a href="#Feature-Encoding" data-toc-modified-id="Feature-Encoding-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Feature Encoding</a></span><ul class="toc-item"><li><span><a href="#Discretization-(Binning)" data-toc-modified-id="Discretization-(Binning)-2.5.1"><span class="toc-item-num">2.5.1&nbsp;&nbsp;</span>Discretization (Binning)</a></span><ul class="toc-item"><li><span><a href="#Custom-Function" data-toc-modified-id="Custom-Function-2.5.1.1"><span class="toc-item-num">2.5.1.1&nbsp;&nbsp;</span>Custom Function</a></span></li><li><span><a href="#Equal-Width" data-toc-modified-id="Equal-Width-2.5.1.2"><span class="toc-item-num">2.5.1.2&nbsp;&nbsp;</span>Equal-Width</a></span></li><li><span><a href="#Equal-Frequency" data-toc-modified-id="Equal-Frequency-2.5.1.3"><span class="toc-item-num">2.5.1.3&nbsp;&nbsp;</span>Equal-Frequency</a></span></li></ul></li><li><span><a href="#Categorical-Data-Encoding" data-toc-modified-id="Categorical-Data-Encoding-2.5.2"><span class="toc-item-num">2.5.2&nbsp;&nbsp;</span>Categorical Data Encoding</a></span><ul class="toc-item"><li><span><a href="#Load-Dataset" data-toc-modified-id="Load-Dataset-2.5.2.1"><span class="toc-item-num">2.5.2.1&nbsp;&nbsp;</span>Load Dataset</a></span></li><li><span><a href="#Find-and-Replace" data-toc-modified-id="Find-and-Replace-2.5.2.2"><span class="toc-item-num">2.5.2.2&nbsp;&nbsp;</span>Find and Replace</a></span></li><li><span><a href="#Ordinal-Features" data-toc-modified-id="Ordinal-Features-2.5.2.3"><span class="toc-item-num">2.5.2.3&nbsp;&nbsp;</span>Ordinal Features</a></span><ul class="toc-item"><li><span><a href="#Ordinal-Encoding" data-toc-modified-id="Ordinal-Encoding-2.5.2.3.1"><span class="toc-item-num">2.5.2.3.1&nbsp;&nbsp;</span>Ordinal Encoding</a></span></li><li><span><a href="#Label-Encoding" data-toc-modified-id="Label-Encoding-2.5.2.3.2"><span class="toc-item-num">2.5.2.3.2&nbsp;&nbsp;</span>Label Encoding</a></span></li></ul></li><li><span><a href="#Nominal-Features" data-toc-modified-id="Nominal-Features-2.5.2.4"><span class="toc-item-num">2.5.2.4&nbsp;&nbsp;</span>Nominal Features</a></span><ul class="toc-item"><li><span><a href="#One-Hot-Encoding" data-toc-modified-id="One-Hot-Encoding-2.5.2.4.1"><span class="toc-item-num">2.5.2.4.1&nbsp;&nbsp;</span>One Hot Encoding</a></span></li></ul></li><li><span><a href="#Wrap-up" data-toc-modified-id="Wrap-up-2.5.2.5"><span class="toc-item-num">2.5.2.5&nbsp;&nbsp;</span>Wrap-up</a></span></li><li><span><a href="#Advanced-Approaches" data-toc-modified-id="Advanced-Approaches-2.5.2.6"><span class="toc-item-num">2.5.2.6&nbsp;&nbsp;</span>Advanced Approaches</a></span></li><li><span><a href="#scikit-learn-pipelines" data-toc-modified-id="scikit-learn-pipelines-2.5.2.7"><span class="toc-item-num">2.5.2.7&nbsp;&nbsp;</span>scikit-learn pipelines</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Bibliography" data-toc-modified-id="Bibliography-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Bibliography</a></span></li></ul></div>

# Data Wrangling <a class="tocSkip">

<div class="alert alert-success alertsuccess" style="margin-top: 20px">

## Objetivos de aprendizagem  <a class="tocSkip">
    
No final deste notebook o aluno deverá dominar o processo de limpeza de dados.

## Learning Objectives  <a class="tocSkip">
       
When concluding this notebook, the student should master the data wrangling process. </div>

<div class="alert alert-success alertsuccess" style="margin-top: 20px">

## Sumário  <a class="tocSkip">
### Limpeza de Dados <a class="tocSkip">

Introdução dos alunos ao processo de limpeza e transformação de dados
- passo 1: limpeza de dados (valores nulos, duplicados)
- passo 2: transformação de dados (alteração de tipos de dados, conversão de dataframes em arrays numpy, adição de novos dados, normalização de dados, encoding de features)
    
## Class Summary  <a class="tocSkip">
### Data Wrangling <a class="tocSkip">
Introducing students to the data wrangling process
- step 1: data cleaning (NaN values, duplicates)
- step 2: data transformation (data types modification, converting dataframes to numpy arrays, adding new data, normalization, feature encosing)

</div>

<hr>

Ciência de dados (data science) é um processo que emprega técnicas estatísticas e computacionais para analisar grandes bases de dados, procurando extrair delas conhecimento útil para empresas, instituições científicas, governos e demais organizações.

De acordo com a literatura, a etapa de pré-processamento de
dados costuma ser a mais trabalhosa em qualquer
projeto relacionado à ciência de dados, ocupando tipicamente 80%
do tempo consumido. É nesta fase que são realizadas as tarefas de
seleção, limpeza e transformação dos dados que serão utilizados
posteriormente pelo algoritmo de Machine Learning / Estatística.

As atividades de seleção, limpeza e transformação de dados são comumente referenciadas como atividades de Data `Wrangling`, `Data Munging` ou `Data Preparation`. A biblioteca pandas (Python Data Analysis Library) foi
especialmente projetada para oferecer o suporte ao processo de Data Wrangling.

## Step 1: Data Cleaning

### Missing Data (NaN)

Here we begin by defining a function to load the dataset, as this dataset will be used several times in this section.

In [1]:
def load_dataset_marks():
    # Import pandas package
    import pandas as pd

    # Assign data
    data = {'Name': ['Jai', 'Princi', 'Gaurav',
                     'Anuj', 'Ravi', 'Natasha', 'Riya'],
            'Age': ['N/A', 17, 18, 17, 18, 17, 17],
            'Gender': ['M', 'F', 'M', 'M', 'M', 'F', 'F'],
            'Marks1': [None, -9999, None, 74, 65, None, None],
            'Marks2': [100, 7, 60, None, 65, 90, 95]}

    # Convert into DataFrame
    df = pd.DataFrame(data)

    # Display data
    return df

In [2]:
df = load_dataset_marks()
df

      Name  Age Gender  Marks1  Marks2
0      Jai  N/A      M     NaN   100.0
1   Princi   17      F -9999.0     7.0
2   Gaurav   18      M     NaN    60.0
3     Anuj   17      M    74.0     NaN
4     Ravi   18      M    65.0    65.0
5  Natasha   17      F     NaN    90.0
6     Riya   17      F     NaN    95.0

#### Checking for Missing Data

The following lists information about the records with `non-N/A` values:

In [3]:
df.count()

Name      7
Age       7
Gender    7
Marks1    3
Marks2    6
dtype: int64

We will start by checking the dataset for missing or null values. For this, we can use the `isna()` or `isnull()` method which returns a dataframe of boolean values indicating if a field is null or not. To group all missing values by column, we can include the `sum()` method.

In [4]:
df.isna().sum()

Name      0
Age       0
Gender    0
Marks1    4
Marks2    1
dtype: int64

Here we are going to find out the percentage of missing values in each variable.

In [5]:
df.isna().sum()/df.shape[0] * 100

Name       0.000000
Age        0.000000
Gender     0.000000
Marks1    57.142857
Marks2    14.285714
dtype: float64

The following code shows the records that have at least one `NaN` value.

In [6]:
df[df.isnull().any(axis=1)].head()

      Name  Age Gender  Marks1  Marks2
0      Jai  N/A      M     NaN   100.0
2   Gaurav   18      M     NaN    60.0
3     Anuj   17      M    74.0     NaN
5  Natasha   17      F     NaN    90.0
6     Riya   17      F     NaN    95.0

We can also count the number of NaN values per row and put it in another column.

In [7]:
df['count_nan'] = df.iloc[:,3:].isna().sum(axis=1)
df

      Name  Age Gender  Marks1  Marks2  count_nan
0      Jai  N/A      M     NaN   100.0          1
1   Princi   17      F -9999.0     7.0          0
2   Gaurav   18      M     NaN    60.0          1
3     Anuj   17      M    74.0     NaN          1
4     Ravi   18      M    65.0    65.0          0
5  Natasha   17      F     NaN    90.0          1
6     Riya   17      F     NaN    95.0          1

#### replace

It happens more often than not, that NaN values are represented not as NaN but as another value, such as `-9999` or `N/A`. One way to replace these values by NaN is by applying the `replace` method:

The following enables to replace one value (the `-9999`).

In [8]:
import numpy as np

df = load_dataset_marks()
df.replace(-9999, np.nan, inplace=True)
df

      Name  Age Gender  Marks1  Marks2
0      Jai  N/A      M     NaN   100.0
1   Princi   17      F     NaN     7.0
2   Gaurav   18      M     NaN    60.0
3     Anuj   17      M    74.0     NaN
4     Ravi   18      M    65.0    65.0
5  Natasha   17      F     NaN    90.0
6     Riya   17      F     NaN    95.0

There is also the chance to replace more than one value at the same time:

In [9]:
df = load_dataset_marks()
df

      Name  Age Gender  Marks1  Marks2
0      Jai  N/A      M     NaN   100.0
1   Princi   17      F -9999.0     7.0
2   Gaurav   18      M     NaN    60.0
3     Anuj   17      M    74.0     NaN
4     Ravi   18      M    65.0    65.0
5  Natasha   17      F     NaN    90.0
6     Riya   17      F     NaN    95.0

In [10]:
import numpy as np
df = load_dataset_marks()
df.replace({-9999: np.nan, 'N/A': np.nan}, inplace=True)
df

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M     NaN   100.0
1   Princi  17.0      F     NaN     7.0
2   Gaurav  18.0      M     NaN    60.0
3     Anuj  17.0      M    74.0     NaN
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F     NaN    90.0
6     Riya  17.0      F     NaN    95.0

#### Deletion (DropNa)

O comando `dropna` permite eliminar as linhas com pelo menos um registo em falta.

In [11]:
df.dropna()

   Name   Age Gender  Marks1  Marks2
4  Ravi  18.0      M    65.0    65.0

Quando all é definido `dropna(how='all', inplace=True)` significa que só vai remover no caso de todas as colunas terem os valores a `NaN`.

Situações há em que apenas se pretende eliminar as linhas NaN de uma determinada coluna. Nesse caso deverá recorrer não só ao dropna mas também ao `subset` para especificar qual a coluna a partir da qual se pretendem eliminar as linhas.

In [12]:
import numpy as np
df = load_dataset_marks()
df.replace({-9999: np.nan, 'N/A': np.nan}, inplace=True)
df

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M     NaN   100.0
1   Princi  17.0      F     NaN     7.0
2   Gaurav  18.0      M     NaN    60.0
3     Anuj  17.0      M    74.0     NaN
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F     NaN    90.0
6     Riya  17.0      F     NaN    95.0

Observe-se que o registo com o índice 3 mantêm-se disponível apesar da existência de um `NaN` (uma vez que o mesmo é na coluna `Marks2`).

In [13]:
df.dropna(subset = ['Marks1'], inplace=True)
df

   Name   Age Gender  Marks1  Marks2
3  Anuj  17.0      M    74.0     NaN
4  Ravi  18.0      M    65.0    65.0

<hr>

#### Imputation (FillNa)

##### Mean

Let's load the dataset again.

In [14]:
import numpy as np
df = load_dataset_marks()
df.replace({-9999: np.nan, 'N/A': np.nan}, inplace=True)
df

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M     NaN   100.0
1   Princi  17.0      F     NaN     7.0
2   Gaurav  18.0      M     NaN    60.0
3     Anuj  17.0      M    74.0     NaN
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F     NaN    90.0
6     Riya  17.0      F     NaN    95.0

We illustrate this process for the `Marks1` column. We begin by converting the Marks column from object datatype to numeric. Next the `nan` values are replaced by the mean value of the `Marks1`.

In [15]:
import pandas as pd

#convert from object type to numeric
df['Marks1'] = pd.to_numeric(df['Marks1'],errors='coerce')

#Calculate mean
mean = df['Marks1'].mean()

#Fill nan
#df['Marks'].fillna(mean, inplace=True)
#df['Marks'] = df['Marks'].fillna(mean)
df.fillna({"Marks1": mean}, inplace=True)

df

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M    69.5   100.0
1   Princi  17.0      F    69.5     7.0
2   Gaurav  18.0      M    69.5    60.0
3     Anuj  17.0      M    74.0     NaN
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F    69.5    90.0
6     Riya  17.0      F    69.5    95.0

##### Mode

A similar process could be done for the `mode` with slight changes. This time we illustrate this process for the `Age` column.

In [16]:
import numpy as np
df = load_dataset_marks()
df.replace({-9999: np.nan, 'N/A': np.nan}, inplace=True)
df

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M     NaN   100.0
1   Princi  17.0      F     NaN     7.0
2   Gaurav  18.0      M     NaN    60.0
3     Anuj  17.0      M    74.0     NaN
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F     NaN    90.0
6     Riya  17.0      F     NaN    95.0

In [ ]:
#convert from object type to numeric
df['Age'] = pd.to_numeric(df['Age'],errors='coerce')

#Calculate mode
mode = df['Age'].mode()[0]

#Fill nan
#df['Marks'].fillna(mode, inplace=True)
#df['Marks'] = df['Marks'].fillna(mode)
df.fillna({"Age": mode}, inplace=True)

df

##### Determining different values to give to fillna

Another interesting thing to do is to fill in the nan values of the column `Marks2` according to the mean of the two different `sex` fields (`M` and `F`). The assumption is that, different mean values can be computed depending on the `Gender`. So instead of calculating a single average value, two `Marks2` values will be computed, one when the `Gender == M` and another one where the `Gender == F`.

In [21]:
import numpy as np
df = load_dataset_marks()
df.replace({-9999: np.nan, 'N/A': np.nan}, inplace=True)

#convert from object type to numeric
df['Marks2'] = pd.to_numeric(df['Marks2'],errors='coerce')

mask_m = df['Gender']=='M'
mean_m = df[mask_m]['Marks2'].mean()
df.loc[mask_m,"Marks2"] = df[mask_m]['Marks2'].fillna(mean_m)

mask_f = df['Gender']=='F'
mean_f = df[mask_f]['Marks2'].mean()
df.loc[mask_f,"Marks2"] = df[mask_f]['Marks2'].fillna(mean_f)

df

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M     NaN   100.0
1   Princi  17.0      F     NaN     7.0
2   Gaurav  18.0      M     NaN    60.0
3     Anuj  17.0      M    74.0    75.0
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F     NaN    90.0
6     Riya  17.0      F     NaN    95.0

Instead of repeating the code we can define a function as follows:

In [22]:
#Create a function to impute missing values based on mean credit score for each income group
def impute_marks(gender_classes):
    """This function takes a list of income groups and imputes the missing values of each based on the mean credit score for          each group"""
    #iterate through each income group
    for gender in gender_classes:      
        
        #create a subset of dataframe to use as filter
        mask = df["Gender"] == gender
        
        #calculate the mean for the income group
        mean = df[mask]["Marks2"].mean()
        
        #fill the missing values with mean of credit score for group
        df.loc[mask,"Marks2"] = df[mask]['Marks2'].fillna(mean)

We can now apply our custom function to the dataframe.

In [23]:
import numpy as np
df = load_dataset_marks()
df.replace({-9999: np.nan, 'N/A': np.nan}, inplace=True)

#Apply the function to the dataframe
gender = ["M","F"]
impute_marks(gender)

df

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M     NaN   100.0
1   Princi  17.0      F     NaN     7.0
2   Gaurav  18.0      M     NaN    60.0
3     Anuj  17.0      M    74.0    75.0
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F     NaN    90.0
6     Riya  17.0      F     NaN    95.0

##### bfill

The `bfill()` method replaces the NULL values with the values from the next row (or next column, if the axis parameter is set to 'columns', `axis=1`). We illustrate this process for the `Marks1` column. One can observe that the last two columns are not replaced due to the fact that there is no value after them to consider.

In [25]:
import numpy as np

df = load_dataset_marks()
df.replace({-9999: np.nan, 'N/A': np.nan}, inplace=True)
df

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M     NaN   100.0
1   Princi  17.0      F     NaN     7.0
2   Gaurav  18.0      M     NaN    60.0
3     Anuj  17.0      M    74.0     NaN
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F     NaN    90.0
6     Riya  17.0      F     NaN    95.0

In [26]:
df['Marks1'].fillna(method="bfill", inplace=True)
df

C:\Users\campo\AppData\Local\Temp\ipykernel_20208\1807588442.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Marks1'].fillna(method="bfill", inplace=True)

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M    74.0   100.0
1   Princi  17.0      F    74.0     7.0
2   Gaurav  18.0      M    74.0    60.0
3     Anuj  17.0      M    74.0     NaN
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F     NaN    90.0
6     Riya  17.0      F     NaN    95.0

##### ffill

The `ffill()` method replaces the NULL values with the values from the previous row (or previous column, if the axis parameter is set to 'columns', `axis=1` ).  `ffill` stands for `forward fill` and will propagate last valid observation forward. We can observe that the first NaN items have not been replaced as there is no previous item to consider.

In [27]:
import numpy as np

df = load_dataset_marks()
df.replace({-9999: np.nan, 'N/A': np.nan}, inplace=True)
df

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M     NaN   100.0
1   Princi  17.0      F     NaN     7.0
2   Gaurav  18.0      M     NaN    60.0
3     Anuj  17.0      M    74.0     NaN
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F     NaN    90.0
6     Riya  17.0      F     NaN    95.0

In [28]:
df['Marks1'].fillna(method="ffill", inplace=True)
df

C:\Users\campo\AppData\Local\Temp\ipykernel_20208\3886390600.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Marks1'].fillna(method="ffill", inplace=True)

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M     NaN   100.0
1   Princi  17.0      F     NaN     7.0
2   Gaurav  18.0      M     NaN    60.0
3     Anuj  17.0      M    74.0     NaN
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F    65.0    90.0
6     Riya  17.0      F    65.0    95.0

There is also the chance to fill in the values (either with the previous or with the next one) in terms of the columns. However, this only makes sense in case we are talking about columns that refer to the same thing (which is not the case, below). In this case, for instance, `Marks1` will get results from `Gender` which doesn't make sense at all.

In [29]:
import numpy as np
df = load_dataset_marks()
df.replace({-9999: np.nan, 'N/A': np.nan}, inplace=True)
df

      Name   Age Gender  Marks1  Marks2
0      Jai   NaN      M     NaN   100.0
1   Princi  17.0      F     NaN     7.0
2   Gaurav  18.0      M     NaN    60.0
3     Anuj  17.0      M    74.0     NaN
4     Ravi  18.0      M    65.0    65.0
5  Natasha  17.0      F     NaN    90.0
6     Riya  17.0      F     NaN    95.0

In [30]:
df = df.fillna(method="ffill", axis = 1)
df

C:\Users\campo\AppData\Local\Temp\ipykernel_20208\2192981752.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df = df.fillna(method="ffill", axis = 1)

      Name   Age Gender Marks1 Marks2
0      Jai   Jai      M      M  100.0
1   Princi  17.0      F      F    7.0
2   Gaurav  18.0      M      M   60.0
3     Anuj  17.0      M   74.0   74.0
4     Ravi  18.0      M   65.0   65.0
5  Natasha  17.0      F      F   90.0
6     Riya  17.0      F      F   95.0

##### Default Value

There is also the chance to fill missing values with a default value:

In [31]:
import numpy as np
df = load_dataset_marks()
df.replace({-9999: np.nan, 'N/A': np.nan}, inplace=True)
df.fillna("0", inplace = True)
df

C:\Users\campo\AppData\Local\Temp\ipykernel_20208\1679045030.py:4: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '0' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.fillna("0", inplace = True)

      Name   Age Gender Marks1 Marks2
0      Jai     0      M      0  100.0
1   Princi  17.0      F      0    7.0
2   Gaurav  18.0      M      0   60.0
3     Anuj  17.0      M   74.0      0
4     Ravi  18.0      M   65.0   65.0
5  Natasha  17.0      F      0   90.0
6     Riya  17.0      F      0   95.0

<hr>

### Duplicates

In [32]:
import pandas as pd

data = {'nome': ['Argentina','Argentina','Argentina','Itália','Argentina'],
         'continente': ['América','América','América','Europa','Europa'],
         'extensao': [2780,2780,2780,301,244],
         'corVerde': [0,0,0,1,1]
}

df = pd.DataFrame(data)
df

        nome continente  extensao  corVerde
0  Argentina    América      2780         0
1  Argentina    América      2780         0
2  Argentina    América      2780         0
3     Itália     Europa       301         1
4  Argentina     Europa       244         1

#### Identify

O comando seguinte marca os registos duplicados (levando em consideração todas as colunas) com o boolean True. Por defeito o pandas mantém o primeiro registo (keep = 'first') e considera como duplicados todos os restantes que apareçam.

In [33]:
df.duplicated(keep = 'first')

0    False
1     True
2     True
3    False
4    False
dtype: bool

 Sendo este o comportamento de default não é necessário recorrer ao parâmetro keep:

In [34]:
df.duplicated()

0    False
1     True
2     True
3    False
4    False
dtype: bool

Já o parâmetro `keep = false` considera todos os registos como duplicados.

In [35]:
df.duplicated(keep = False)

0     True
1     True
2     True
3    False
4    False
dtype: bool

Podemos contabilizar o número de registos duplicados:

In [36]:
df.duplicated().sum()

2

Se pretendermos saber que registos são esses (a True) basta executar o seguinte código:

In [37]:
df[df.duplicated()]

        nome continente  extensao  corVerde
1  Argentina    América      2780         0
2  Argentina    América      2780         0

É possível também verificarmos duplicações numa coluna em específico:

In [38]:
df['nome'].duplicated()
#df.duplicated(subset='nome')

0    False
1     True
2     True
3    False
4     True
Name: nome, dtype: bool

Se pretendermos especificar mais do que uma coluna podemos recorrer a listas e ao parâmetro subset:

In [39]:
df[['nome','continente']].duplicated()
#df.duplicated(subset=['nome','continente'])

0    False
1     True
2     True
3    False
4    False
dtype: bool

#### Drop

É possível eliminar todos os registos duplicados. O exemplo abaixo faz isso tomando em consideração todas as colunas. Tenha em atenção também que esta operação tem como default `inplace=False`, pelo que se pretender que efetivamente a eliminação dos duplicados tenha efeito, deverá passar `inplace=True` como parâmetro

In [40]:
df.drop_duplicates()

        nome continente  extensao  corVerde
0  Argentina    América      2780         0
3     Itália     Europa       301         1
4  Argentina     Europa       244         1

Também poderá optar por decidir qual dos duplicados pretende manter:

In [41]:
df.drop_duplicates(keep = 'last')

        nome continente  extensao  corVerde
2  Argentina    América      2780         0
3     Itália     Europa       301         1
4  Argentina     Europa       244         1

Podemos especificar a coluna que deve contribuir para a análise dos duplicados:

In [42]:
df.drop_duplicates(subset='nome')

        nome continente  extensao  corVerde
0  Argentina    América      2780         0
3     Itália     Europa       301         1

Ou as colunas:

In [43]:
df.drop_duplicates(subset=['nome','continente'])

        nome continente  extensao  corVerde
0  Argentina    América      2780         0
3     Itália     Europa       301         1
4  Argentina     Europa       244         1

Tal como referido atrás, para que a eliminação tenha consequência deverá recorrer ao parâmetro `inplace=True`. Adicionalmente é possível fazer um reset aos índices para que a contabilização de todos os registos reinicie em 0.

In [44]:
df.drop_duplicates(keep = 'last', inplace=True)
df = df.reset_index(drop=True)
df

        nome continente  extensao  corVerde
0  Argentina    América      2780         0
1     Itália     Europa       301         1
2  Argentina     Europa       244         1

<hr>

## Step 2: Data Transformation

### Change Data Types

#### dates

Para exemplificar algumas operações comuns de data wrangling recorremos ao `Melbourne housing dataset` disponível no [kaggle](https://www.kaggle.com/dansbecker/melbourne-housing-snapshot). Para começar vamos ler o ficheiro csv.

In [53]:
import numpy as np
import pandas as pd

pd.set_option('display.max_columns', None)

df = pd.read_csv("data/melb_data.csv")
print(df.shape)

(13580, 21)

In [56]:
df.head(10)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,2.0,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,2.0,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,3.0,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0
5,Abbotsford,129 Charles St,2,h,941000.0,S,Jellis,7/05/2016,2.5,3067.0,2.0,1.0,0.0,181.0,NaN,NaN,Yarra,-37.8041,144.9953,Northern Metropolitan,4019.0
6,Abbotsford,124 Yarra St,3,h,1876000.0,S,Nelson,7/05/2016,2.5,3067.0,4.0,2.0,0.0,245.0,210.0,1910.0,Yarra,-37.8024,144.9993,Northern Metropolitan,4019.0
7,Abbotsford,98 Charles St,2,h,1636000.0,S,Nelson,8/10/2016,2.5,3067.0,2.0,1.0,2.0,256.0,107.0,1890.0,Yarra,-37.8060,144.9954,Northern Metropolitan,4019.0
8,Abbotsford,6/241 Nicholson St,1,u,300000.0,S,Biggin,8/10/2016,2.5,3067.0,1.0,1.0,1.0,0.0,NaN,NaN,Yarra,-37.8008,144.9973,Northern Metropolitan,4019.0
9,Abbotsford,10 Valiant St,2,h,1097000.0,S,Biggin,8/10/2016,2.5,3067.0,3.0,1.0,2.0,220.0,75.0,1900.0,Yarra,-37.8010,144.9989,Northern Metropolitan,4019.0

The dates are usually stored as objects or strings. The date column in our dataset is stored as object.

In [47]:
df['Date'].dtypes

dtype('O')

In order to use the date time specific functions of Pandas, we need to convert the dates to an appropriate format. One option is to use the `to_datetime` function.

In [48]:
# Before converting
df['Date'][:2]

0    3/12/2016
1    4/02/2016
Name: Date, dtype: object

A conversão da coluna `date` em formato de datetime é possível com recurso ao código `to_datetime`. Da execução do código abaixo é possível observar que o formato da data não foi adequadamente inferido, dado que o sistema considera por default o formado US ("%m/%d/%Y"), quando na verdade as datas estão no formato europeu. Repare que no final da mensagem de erro são-lhe oferecidas algumas opções:

In [59]:
df['Date'] = pd.to_datetime(df['Date'])

ValueError: time data "13/08/2016" doesn't match format "%m/%d/%Y", at position 7. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

Uma dessas opções é o recurso à utilização do parâmetro `dayfirst=True` que especifica o formato Europeu `day/month/year`.

In [61]:
df['Date'] = pd.to_datetime(df['Date'], dayfirst=True)
#df['Date'] = pd.to_datetime(df['Date'], format="%d/%m/%Y")

In [62]:
# After converting
df.Date[:2]

0   2016-12-03
1   2016-02-04
Name: Date, dtype: datetime64[ns]

In some cases, we may need to extract a particular part from dates such as weekday, hour, day, month, year, and so on. We can use the functions under the dt accessor to extract pretty much any piece of information about a date.

In [63]:
# Extract month
df['Month'] = df['Date'].dt.month
df['Month'][:5]

0    12
1     2
2     3
3     3
4     6
Name: Month, dtype: int32

In [64]:
# Extract weekday
df['Weekday'] = df['Date'].dt.weekday
df['Weekday'][:5]

0    5
1    3
2    5
3    5
4    5
Name: Weekday, dtype: int32

Por sua vez `dt.week`, `dt.dayofweek` e `dt.is_leap_year` permite ter acesso ao número da semana, ao dia da semana  (onde 0 significa segunda-feira) e ao facto de se tratar ou não um ano bissexto.

Para obter o número de anos percorrido entre a `date` e o dia de hoje recorremos ao seguinte código:

In [65]:
import pandas as pd

df['Year'] = df['Date'].dt.year

today = pd.to_datetime('today')
df['Age'] = today.year - df['Year']
df

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Month,Weekday,Year,Age
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,2016-12-03,2.5,3067.0,2.0,1.0,1.0,202.0,NaN,NaN,Yarra,-37.79960,144.99840,Northern Metropolitan,4019.0,12,5,2016,8
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,2016-02-04,2.5,3067.0,2.0,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.80790,144.99340,Northern Metropolitan,4019.0,2,3,2016,8
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,2017-03-04,2.5,3067.0,3.0,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.80930,144.99440,Northern Metropolitan,4019.0,3,5,2017,7
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,2017-03-04,2.5,3067.0,3.0,2.0,1.0,94.0,NaN,NaN,Yarra,-37.79690,144.99690,Northern Metropolitan,4019.0,3,5,2017,7
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,2016-06-04,2.5,3067.0,3.0,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.80720,144.99410,Northern Metropolitan,4019.0,6,5,2016,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13575,Wheelers Hill,12 Strada Cr,4,h,1245000.0,S,Barry,2017-08-26,16.7,3150.0,4.0,2.0,2.0,652.0,NaN,1981.0,NaN,-37.90562,145.16761,South-Eastern Metropolitan,7392.0,8,5,2017,7
13576,Williamstown,77 Merrett Dr,3,h,1031000.0,SP,Williams,2017-08-26,6.8,3016.0,3.0,2.0,2.0,333.0,133.0,1995.0,NaN,-37.85927,144.87904,Western Metropolitan,6380.0,8,5,2017,7
13577,Williamstown,83 Power St,3,h,1170000.0,S,Raine,2017-08-26,6.8,3016.0,3.0,2.0,4.0,436.0,NaN,1997.0,NaN,-37.85274,144.88738,Western Metropolitan,6380.0,8,5,2017,7
13578,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,2017-08-26,6.8,3016.0,4.0,1.0,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0,8,5,2017,7
13579,Yarraville,6 Agnes St,4,h,1285000.0,SP,Village,2017-08-26,6.3,3013.0,4.0,1.0,1.0,362.0,112.0,1920.0,NaN,-37.81188,144.88449,Western Metropolitan,6543.0,8,5,2017,7

#### int (astype)

In addition to dates, we may need to do some other data type conversions as well. A typical case that need conversion would be storing integers as floats. For instance, the property column in our dataset is stored as float but it should be integer. The `astype` function can be used to do data type conversions.

In [66]:
import numpy as np
import pandas as pd

pd.set_option('display.max_columns', None)

df = pd.read_csv("data/melb_data.csv")
df.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,2.0,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,2.0,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,3.0,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0

In [67]:
# Before converting
df['Propertycount'].dtypes

dtype('float64')

In the following, we show how to convert a specific column by specifying it in a dictionary. Other columns (and different types) could have been added too.

In [68]:
df = df.astype({'Propertycount':'int64'})
df.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,2.0,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,2.0,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,3.0,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019

In [69]:
#After converting
df['Propertycount'].dtypes

dtype('int64')

#### float (astype)

Suponha agora o seguinte ficheiro. Imagine que pretende calcular a média dos `item_price`.

In [70]:
import pandas as pd
df = pd.read_csv("http://bit.ly/chiporders", sep='\t')
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

Conforme pode observar `item_price` encontra-se definido como uma string.

In [71]:
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

Para calcular a média, terá primeiro que remover o caracter `$` e posteriormente converter o tipo de dados para float. Só depois poderá calcular a média:

In [72]:
df['item_price'].str.replace('$','').astype(float).mean()

7.464335785374297

#### category (astype)

Back to our original dataframe:

In [73]:
import numpy as np
import pandas as pd

pd.set_option('display.max_columns', None)

df = pd.read_csv("data/melb_data.csv")
df.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,2.0,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,2.0,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,3.0,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0

A typical dataset contains both numerical and categorical columns. The categorical columns are usually stored with object data type. If the number of distinct categories are very few compared to the number of rows, we can save a substantial amount of memory by using the category data type.

Our dataset contains 13580 rows. The number of categories in the type column is 3. Let’s first check the memory consumption (in bytes) of this column.

In [74]:
df['Type'].memory_usage()

108772

We will convert it to the category data type and check the memory consumption again.

In [75]:
df = df.astype({'Type':'category'})
df.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,2.0,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,2.0,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,3.0,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0

In [76]:
df.Type.memory_usage()

13844

In [77]:
df['Type'].dtypes

CategoricalDtype(categories=['h', 't', 'u'], ordered=False, categories_dtype=object)

#### str

Textual data usually contains multiple pieces of information. Just like we have done with dates, we may need to extract a piece of information from a text. The `str` accessor of Pandas provides numerous function to perform such operations efficiently. Let’s take a look at the address column.

In [78]:
import numpy as np
import pandas as pd

df = pd.read_csv("data/melb_data.csv")
print(df.shape)

(13580, 21)

In [79]:
df['Address'][:5]

0        85 Turner St
1     25 Bloomburg St
2        5 Charles St
3    40 Federation La
4         55a Park St
Name: Address, dtype: object

The last characters represent the type of location. For instance, `st` stands for street and `dr` stands for drive. It can be a useful piece of information for grouping the addresses.

We can extract the last part of the address by splitting the strings at space character and taking the last split. Here is how we do this operation with the str accessor. The split function, as the same suggests, splits a string at the specified character which is space in our case. The next str is used for accessing the pieces after splitting. “-1” means the last one.

In [80]:
df['Address'].str.split(' ').str[-1]

0        St
1        St
2        St
3        La
4        St
         ..
13575    Cr
13576    Dr
13577    St
13578    St
13579    St
Name: Address, Length: 13580, dtype: object

Uppercase:

In [81]:
df['Address'].str.upper()

0            85 TURNER ST
1         25 BLOOMBURG ST
2            5 CHARLES ST
3        40 FEDERATION LA
4             55A PARK ST
               ...
13575        12 STRADA CR
13576       77 MERRETT DR
13577         83 POWER ST
13578        96 VERDON ST
13579          6 AGNES ST
Name: Address, Length: 13580, dtype: object

Contains retrieves a series:

In [82]:
df['Address'].str.contains('St')

0         True
1         True
2         True
3        False
4         True
         ...
13575     True
13576    False
13577     True
13578     True
13579     True
Name: Address, Length: 13580, dtype: bool

Why would we use contains? Because we might want to filter results based on that condition:

In [83]:
df[df['Address'].str.contains('St')]

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom2,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,2.0,1.0,1.0,202.0,NaN,NaN,Yarra,-37.79960,144.99840,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,2.0,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.80790,144.99340,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,3.0,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.80930,144.99440,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,3.0,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.80720,144.99410,Northern Metropolitan,4019.0
5,Abbotsford,129 Charles St,2,h,941000.0,S,Jellis,7/05/2016,2.5,3067.0,2.0,1.0,0.0,181.0,NaN,NaN,Yarra,-37.80410,144.99530,Northern Metropolitan,4019.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13574,Westmeadows,9 Black St,3,h,582000.0,S,Red,26/08/2017,16.5,3049.0,3.0,2.0,2.0,256.0,NaN,NaN,NaN,-37.67917,144.89390,Northern Metropolitan,2474.0
13575,Wheelers Hill,12 Strada Cr,4,h,1245000.0,S,Barry,26/08/2017,16.7,3150.0,4.0,2.0,2.0,652.0,NaN,1981.0,NaN,-37.90562,145.16761,South-Eastern Metropolitan,7392.0
13577,Williamstown,83 Power St,3,h,1170000.0,S,Raine,26/08/2017,6.8,3016.0,3.0,2.0,4.0,436.0,NaN,1997.0,NaN,-37.85274,144.88738,Western Metropolitan,6380.0
13578,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,3016.0,4.0,1.0,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0
13579,Yarraville,6 Agnes St,4,h,1285000.0,SP,Village,26/08/2017,6.3,3013.0,4.0,1.0,1.0,362.0,112.0,1920.0,NaN,-37.81188,144.88449,Western Metropolitan,6543.0

Or suppose we want to have this as a numeric feature for a machine learning process:

In [84]:
df['Address'].str.contains('St').astype(float).head()

0    1.0
1    1.0
2    1.0
3    0.0
4    1.0
Name: Address, dtype: float64

For more `str` methods you can search for `str` in the following Pandas documentation page: https://pandas.pydata.org/pandas-docs/stable/reference/index.html

How to use regex in pandas: https://kanoki.org/2019/11/12/how-to-use-regex-in-pandas/

<hr>

In many cases, we do a comparison based on textual data. A typical problem with such comparisons is not having a standard on strings. For instance, same words may not be detected if one starts with a capital case letter and the other is not.

To overcome this issue, we should standardize the strings. We can make them all upper case or lower case letters with the upper and lower functions of the str accessor, respectively

In [85]:
df['Address'].str.upper()[:5]
#df['Address'] = df['Address'].apply(str.upper)

0        85 TURNER ST
1     25 BLOOMBURG ST
2        5 CHARLES ST
3    40 FEDERATION LA
4         55A PARK ST
Name: Address, dtype: object

Another option is to capitalize the strings.

In [86]:
df['Suburb'].str.capitalize()[:5]

0    Abbotsford
1    Abbotsford
2    Abbotsford
3    Abbotsford
4    Abbotsford
Name: Suburb, dtype: object

<hr>

### ConvertDF2Numpy

A conversão de um dataframe para numpy é particularmente útil no caso de estarmos a trabalhar com algoritmos de machine learning. O próximo código começa por fazer a importação de um dataframe:

In [87]:
import pandas as pd
df = pd.read_csv("data/paises.csv",index_col="sigla")
df

              nome continente  extensao  corVerde
sigla
AR       Argentina    América     -9999         0
BR          Brasil    América      8511         1
FR          França     Europa       644         0
IT          Itália     Europa       301         1
UK     Reino Unido     Europa       244         0

O método `to_numpy()` procede à conversão do dataframe para um array numpy:

In [88]:
data = df.to_numpy()
data

array([['Argentina', 'América', -9999, 0],
       ['Brasil', 'América', 8511, 1],
       ['França', 'Europa', 644, 0],
       ['Itália', 'Europa', 301, 1],
       ['Reino Unido', 'Europa', 244, 0]], dtype=object)

A seleção de todos os países faz-se através do seguinte código:

In [89]:
nome = data[:,0]
nome

array(['Argentina', 'Brasil', 'França', 'Itália', 'Reino Unido'],
      dtype=object)

Para selecionarmos a extensão recorreríamos ao seguinte código:

In [90]:
extensao = data[:,2]
extensao

array([-9999, 8511, 644, 301, 244], dtype=object)

Ao invés de recorrermos à conversão num array numpy poderiamos simplesmente proceder à seleção dos valores pretendidos (ainda com recurso ao dataframe) e posteriormente converter a série de dados em valores Numpy (com recurso ao values). O próximo código exemplifica a criação das variáveis X e y, bem como a obtenção dos respetivos valores:

In [96]:
X = df['extensao'].values
y = df['corVerde'].values
print(X)
print(y)

[-9999  8511   644   301   244]
[0 1 0 1 0]

<hr>

### Add New Data

Based on the following tutorial: https://www.dataquest.io/blog/tutorial-how-to-use-the-apply-method-in-pandas/

#### Columns

##### Add

The `apply()` method is one of the most common methods of data preprocessing. It simplifies applying a function on each element in a pandas Series and each row or column in a pandas DataFrame. Let us start by defining the following dataframe:

In [98]:
import pandas as pd

df = pd.DataFrame({'EmployeeName': ['Callen Dunkley', 'Sarah Rayner', 'Jeanette Sloan', 'Kaycee Acosta', 'Henri Conroy', 'Emma Peralta', 'Martin Butt', 'Alex Jensen', 'Kim Howarth', 'Jane Burnett'],
                    'Department': ['Accounting', 'Engineering', 'Engineering', 'HR', 'HR', 'HR', 'Data Science', 'Data Science', 'Accounting', 'Data Science'],
                    'HireDate': [2010, 2018, 2012, 2014, 2014, 2018, 2020, 2018, 2020, 2012],
                    'Sex': ['M', 'F', 'F', 'F', 'M', 'F', 'M', 'M', 'M', 'F'],
                    'Birthdate': ['04/09/1982', '14/04/1981', '06/05/1997', '08/01/1986', '10/10/1988', '12/11/1992', '10/04/1991', '16/07/1995', '08/10/1992', '11/10/1979'],
                    'Weight': [78, 80, 66, 67, 90, 57, 115, 87, 95, 57],
                    'Height': [176, 160, 169, 157, 185, 164, 195, 180, 174, 165],
                    'Kids': [2, 1, 0, 1, 1, 0, 2, 0, 3, 1]
                    })

df

,EmployeeName,Department,HireDate,Sex,Birthdate,Weight,Height,Kids
0,Callen Dunkley,Accounting,2010,M,04/09/1982,78,176,2
1,Sarah Rayner,Engineering,2018,F,14/04/1981,80,160,1
2,Jeanette Sloan,Engineering,2012,F,06/05/1997,66,169,0
3,Kaycee Acosta,HR,2014,F,08/01/1986,67,157,1
4,Henri Conroy,HR,2014,M,10/10/1988,90,185,1
5,Emma Peralta,HR,2018,F,12/11/1992,57,164,0
6,Martin Butt,Data Science,2020,M,10/04/1991,115,195,2
7,Alex Jensen,Data Science,2018,M,16/07/1995,87,180,0
8,Kim Howarth,Accounting,2020,M,08/10/1992,95,174,3
9,Jane Burnett,Data Science,2012,F,11/10/1979,57,165,1

###### Lambda Function

Let’s assume that the HR team wants to send an invitation email that starts with a friendly greeting to all the employees (e.g., Hey, Sarah!). They asked you to create two columns for storing the employees’ first and last names separately, making referring to the employees’ first names easy. To do so, we can use a lambda function that splits a string into a list after breaking it by the specified separator; the default separator character of the split() method is any white space.

In [99]:
df['FirstName'] = df['EmployeeName'].apply(lambda x : x.split()[0])
df['LastName'] = df['EmployeeName'].apply(lambda x : x.split()[1])
df

,EmployeeName,Department,HireDate,Sex,Birthdate,Weight,Height,Kids,FirstName,LastName
0,Callen Dunkley,Accounting,2010,M,04/09/1982,78,176,2,Callen,Dunkley
1,Sarah Rayner,Engineering,2018,F,14/04/1981,80,160,1,Sarah,Rayner
2,Jeanette Sloan,Engineering,2012,F,06/05/1997,66,169,0,Jeanette,Sloan
3,Kaycee Acosta,HR,2014,F,08/01/1986,67,157,1,Kaycee,Acosta
4,Henri Conroy,HR,2014,M,10/10/1988,90,185,1,Henri,Conroy
5,Emma Peralta,HR,2018,F,12/11/1992,57,164,0,Emma,Peralta
6,Martin Butt,Data Science,2020,M,10/04/1991,115,195,2,Martin,Butt
7,Alex Jensen,Data Science,2018,M,16/07/1995,87,180,0,Alex,Jensen
8,Kim Howarth,Accounting,2020,M,08/10/1992,95,174,3,Kim,Howarth
9,Jane Burnett,Data Science,2012,F,11/10/1979,57,165,1,Jane,Burnett

###### Custom Function

Let’s assume that the HR team wants to know every employee’s age and the average age of the employees because they want to determine if an employee’s age influences job satisfaction and work engagement. To get the job done, the first step is to define a function that gets an employee’s date of birth and returns their age. Instead of using a lambda function we will define our own function (as doing this with lambda would be too complex).

In [100]:
from datetime import datetime, date

def calculate_age(birthdate):
    birthdate = datetime.strptime(birthdate, '%d/%m/%Y').date()
    today = date.today()
    return today.year - birthdate.year - (today.month < birthdate.month)

The `calculate_age()` function gets a person’s date of birth in a proper format and, after performing a simple calculation on it, returns their age. The next step is to apply the function on the Birthdate column of the DataFrame using the apply() method, as follows:

In [101]:
df['Age'] = df['Birthdate'].apply(calculate_age)
df

,EmployeeName,Department,HireDate,Sex,Birthdate,Weight,Height,Kids,FirstName,LastName,Age
0,Callen Dunkley,Accounting,2010,M,04/09/1982,78,176,2,Callen,Dunkley,41
1,Sarah Rayner,Engineering,2018,F,14/04/1981,80,160,1,Sarah,Rayner,43
2,Jeanette Sloan,Engineering,2012,F,06/05/1997,66,169,0,Jeanette,Sloan,26
3,Kaycee Acosta,HR,2014,F,08/01/1986,67,157,1,Kaycee,Acosta,38
4,Henri Conroy,HR,2014,M,10/10/1988,90,185,1,Henri,Conroy,35
5,Emma Peralta,HR,2018,F,12/11/1992,57,164,0,Emma,Peralta,31
6,Martin Butt,Data Science,2020,M,10/04/1991,115,195,2,Martin,Butt,33
7,Alex Jensen,Data Science,2018,M,16/07/1995,87,180,0,Alex,Jensen,28
8,Kim Howarth,Accounting,2020,M,08/10/1992,95,174,3,Kim,Howarth,31
9,Jane Burnett,Data Science,2012,F,11/10/1979,57,165,1,Jane,Burnett,44

The HR manager of the company is exploring options for healthcare coverage for all employees. Potential providers require information about the employees. Since the DataFrame contains the weight and height of each employee, let’s assume the HR manager asked you to provide a Body Mass Index (BMI) for every employee so she can get quotes from potential healthcare providers.

To do the task, first, we need to define a function that calculates the Body Mass Index (BMI). The formula for the BMI is weight in kilograms divided by height in meters squared. Because the employees’ heights are measured in centimeters, we need to divide the heights by 100 to obtain the heights in meters. Let’s implement the function:

In [102]:
def calc_bmi(weight, height):
    return np.round(weight/(height/100)**2, 2)

The next step is to apply the function on the DataFrame. Whenever we have more than 1 parameter, we have to resort to lambda functions. In that case, `apply` is applied to `df` (instead of `df[somecolumn]`) and we need to include the `axis = 1`), which means to iterate over rows in the DataFrame.

In [103]:
df['BMI'] = df.apply(lambda x: calc_bmi(x['Weight'], x['Height']), axis=1)
df

,EmployeeName,Department,HireDate,Sex,Birthdate,Weight,Height,Kids,FirstName,LastName,Age,BMI
0,Callen Dunkley,Accounting,2010,M,04/09/1982,78,176,2,Callen,Dunkley,41,25.18
1,Sarah Rayner,Engineering,2018,F,14/04/1981,80,160,1,Sarah,Rayner,43,31.25
2,Jeanette Sloan,Engineering,2012,F,06/05/1997,66,169,0,Jeanette,Sloan,26,23.11
3,Kaycee Acosta,HR,2014,F,08/01/1986,67,157,1,Kaycee,Acosta,38,27.18
4,Henri Conroy,HR,2014,M,10/10/1988,90,185,1,Henri,Conroy,35,26.30
5,Emma Peralta,HR,2018,F,12/11/1992,57,164,0,Emma,Peralta,31,21.19
6,Martin Butt,Data Science,2020,M,10/04/1991,115,195,2,Martin,Butt,33,30.24
7,Alex Jensen,Data Science,2018,M,16/07/1995,87,180,0,Alex,Jensen,28,26.85
8,Kim Howarth,Accounting,2020,M,08/10/1992,95,174,3,Kim,Howarth,31,31.38
9,Jane Burnett,Data Science,2012,F,11/10/1979,57,165,1,Jane,Burnett,44,20.94

Instead we can redefine the function to get a row of the dataframe, instead of the actual values as a parameter.

In [104]:
def calc_bmi(row):
    weight = row['Weight']
    height = row['Height']
    return np.round(weight/(height/100)**2, 2)

df['BMI'] = df.apply(calc_bmi, axis=1)
df

,EmployeeName,Department,HireDate,Sex,Birthdate,Weight,Height,Kids,FirstName,LastName,Age,BMI
0,Callen Dunkley,Accounting,2010,M,04/09/1982,78,176,2,Callen,Dunkley,41,25.18
1,Sarah Rayner,Engineering,2018,F,14/04/1981,80,160,1,Sarah,Rayner,43,31.25
2,Jeanette Sloan,Engineering,2012,F,06/05/1997,66,169,0,Jeanette,Sloan,26,23.11
3,Kaycee Acosta,HR,2014,F,08/01/1986,67,157,1,Kaycee,Acosta,38,27.18
4,Henri Conroy,HR,2014,M,10/10/1988,90,185,1,Henri,Conroy,35,26.30
5,Emma Peralta,HR,2018,F,12/11/1992,57,164,0,Emma,Peralta,31,21.19
6,Martin Butt,Data Science,2020,M,10/04/1991,115,195,2,Martin,Butt,33,30.24
7,Alex Jensen,Data Science,2018,M,16/07/1995,87,180,0,Alex,Jensen,28,26.85
8,Kim Howarth,Accounting,2020,M,08/10/1992,95,174,3,Kim,Howarth,31,31.38
9,Jane Burnett,Data Science,2012,F,11/10/1979,57,165,1,Jane,Burnett,44,20.94

##### Replace Column Names

In some case we want to replace the names of the columns. Lets start by defining the following dataframe:

In [105]:
import pandas as pd

df = pd.DataFrame({'Value1': [2012, 2017, 2018],
                    'Value2': [2011, 2012, 2017],
                    'Value3': [2010, 2018, 2012],
                    'Country': ['PT', 'FR', 'FR'],
                    })

df

   Value1  Value2  Value3 Country
0    2012    2011    2010      PT
1    2017    2012    2018      FR
2    2018    2017    2012      FR

If one wants to change a specific column, the following code can be used.

In [106]:
df.rename(columns = {'Country':'CT'}, inplace = True)
df

   Value1  Value2  Value3  CT
0    2012    2011    2010  PT
1    2017    2012    2018  FR
2    2018    2017    2012  FR

Instead, if several columns are to be replaced in batch mode we can resort to the following code:

In [107]:
df.columns = df.columns.str.replace('Value', 'Year')
df

   Year1  Year2  Year3  CT
0   2012   2011   2010  PT
1   2017   2012   2018  FR
2   2018   2017   2012  FR

#### Rows

Let’s assume the new year is around the corner and the company management has announced that those employees who have more than ten years of experience will get an extra bonus. The HR manager wants to know who is qualified to get the bonus.

To prepare the requested information, you need to apply the following lambda function on the HireDate column, which returns True if the difference between the current year and the hire year is greater than or equal to ten years otherwise False.

In [108]:
import pandas as pd

df = pd.DataFrame({'EmployeeName': ['Callen Dunkley', 'Sarah Rayner', 'Jeanette Sloan', 'Kaycee Acosta', 'Henri Conroy', 'Emma Peralta', 'Martin Butt', 'Alex Jensen', 'Kim Howarth', 'Jane Burnett'],
                    'Department': ['Accounting', 'Engineering', 'Engineering', 'HR', 'HR', 'HR', 'Data Science', 'Data Science', 'Accounting', 'Data Science'],
                    'HireDate': [2010, 2018, 2012, 2014, 2014, 2018, 2020, 2018, 2020, 2012],
                    'Sex': ['M', 'F', 'F', 'F', 'M', 'F', 'M', 'M', 'M', 'F'],
                    'Birthdate': ['04/09/1982', '14/04/1981', '06/05/1997', '08/01/1986', '10/10/1988', '12/11/1992', '10/04/1991', '16/07/1995', '08/10/1992', '11/10/1979'],
                    'Weight': [78, 80, 66, 67, 90, 57, 115, 87, 95, 57],
                    'Height': [176, 160, 169, 157, 185, 164, 195, 180, 174, 165],
                    'Kids': [2, 1, 0, 1, 1, 0, 2, 0, 3, 1]
                    })

df

,EmployeeName,Department,HireDate,Sex,Birthdate,Weight,Height,Kids
0,Callen Dunkley,Accounting,2010,M,04/09/1982,78,176,2
1,Sarah Rayner,Engineering,2018,F,14/04/1981,80,160,1
2,Jeanette Sloan,Engineering,2012,F,06/05/1997,66,169,0
3,Kaycee Acosta,HR,2014,F,08/01/1986,67,157,1
4,Henri Conroy,HR,2014,M,10/10/1988,90,185,1
5,Emma Peralta,HR,2018,F,12/11/1992,57,164,0
6,Martin Butt,Data Science,2020,M,10/04/1991,115,195,2
7,Alex Jensen,Data Science,2018,M,16/07/1995,87,180,0
8,Kim Howarth,Accounting,2020,M,08/10/1992,95,174,3
9,Jane Burnett,Data Science,2012,F,11/10/1979,57,165,1

In [109]:
from datetime import date

df[df['HireDate'].apply(lambda x: date.today().year - x >= 10)]

,EmployeeName,Department,HireDate,Sex,Birthdate,Weight,Height,Kids
0,Callen Dunkley,Accounting,2010,M,04/09/1982,78,176,2
2,Jeanette Sloan,Engineering,2012,F,06/05/1997,66,169,0
3,Kaycee Acosta,HR,2014,F,08/01/1986,67,157,1
4,Henri Conroy,HR,2014,M,10/10/1988,90,185,1
9,Jane Burnett,Data Science,2012,F,11/10/1979,57,165,1

<hr>

#### Vectorization

In this talk, Nathan Cheever, we will go over multiple ways to enhance a data transformation workflow with Pandas and Numpy by showing how to replace slower, perhaps more familiar, ways of operating on Pandas data frames

In [ ]:
from IPython.display import HTML
HTML('<div align="center"><iframe width="560" height="315" src="https://www.youtube.com/embed/nxWginnBklU" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe></div>')

When using Loops or `Apply` to perform calculations on a Pandas dataframe, the operation is applied sequentially. This causes repeated access to memory, calculations, and updated values which can be slow and resource-intensive. To sum up, the Pandas `apply()` function is slow! It does not take the advantage of vectorization and it acts as just another loop.

Vectorized operations, on the other hand, are implemented in Cython (Python in C or C++) and utilize the CPU's vector processing capabilities, which can perform multiple operations at once, further increasing performance by calculating multiple parameters at the same time.

The reason why vectorization is so much faster than Looping/Iterating and Apply is that it doesn’t calculate the entire row every single time but instead applies the parameters to the entire dataset as a whole. Vectorization is a process where operations are applied to entire arrays of data at once, instead of operating on each element of the array individually. This allows for much more efficient use of memory and CPU resources.

Let's consider the following example which consists of 1M values.

In [110]:
A_list = np.random.randint(1, 100, 1000000)
B_list = np.random.randint(1, 100, 1000000)
df = pd.DataFrame({'x': A_list, 'y': B_list})

In [111]:
df

         x   y
0       43  17
1       70  40
2       28  46
3        3  65
4       13  66
...     ..  ..
999995  79   6
999996  22  42
999997  23  16
999998  53  60
999999  67  70

[1000000 rows x 2 columns]

We begin by running the code with the non-vectorized function `apply` which calls a Python function for every row with the code being called repeatedly.

In [112]:
# ... Non-vectorized operation:
def calc_ratio(row):
    return 100 * (row["x"] + row["y"])

%timeit df["ratio1"] = df.apply(calc_ratio, axis=1)

22.1 s ± 1.39 s per loop (mean ± std. dev. of 7 runs, 1 loop each)

##### Series

Instead, we can resort to vectorized operations which can apply to entire DataFrames and Series. This includes mathematical operations, comparisons, and logic to create a boolean mask to select multiple rows from your dataset.

The vectorized `100 * (df["x"] / df["y"])` is much faster because it avoids using Python code in the inner loop

In [113]:
#vectorized
%timeit df["ratio2"] = 100 * (df["x"] + df["y"])

10.3 ms ± 1.2 ms per loop (mean ± std. dev. of 7 runs, 100 loops each)

##### Numpy

Put simply, vectorization allows numpy to perform a function once over an entire array rather than individually to each element within it.

###### Numpy Functions

Use NumPy Functions that have implemented C like `add`

In [114]:
import numpy as np
%timeit df["ratio2"] = 100 * np.add(df["x"],df["y"])

10.8 ms ± 1.17 ms per loop (mean ± std. dev. of 7 runs, 100 loops each)

###### numpy where

Now let’s think about this a little bit more with the example of `numpy.where`, which I’ll be referring to moving forward as `np.where`. 

`np.where` uses the syntax: `np.where(condition, x, y)`. `Condition` is a boolean condition where, if `True`, we want to return `x`. If `False`, we want to return `y`.

The following is the traditional non-vectorized `apply` function:

In [115]:
def odd(x):
    if x%2 == 1:
        return 1
    else:
        return 0
    
%timeit df['odd'] = df['x'].apply(lambda x: odd)

240 ms ± 22.1 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

Next we have a vectorized version, which used the `where` clause. Not only is faster but it also more readable.

In [116]:
import numpy as np
%timeit df['odd'] = np.where(df['x']%2 == 1,1,0)

20.6 ms ± 3.58 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

### Normalization

Em qualquer base dados, é comum que diferentes variáveis
(atributos) estejam representadas em diferentes unidades de
medidas. Por exemplo, os atributos `population`, `area` e `colours`, todos eles têm diferentes
atributos numéricos presentes na base de dados flags.

- population : milhões de pessoas
- area : milhares de quilómetros quadrados
- colours : unidades

In [117]:
import pandas as pd
df = pd.read_csv('data/flags.csv')
df[['population','area','colours']].head()

   population  area  colours
0          16   648        5
1           3    29        3
2          20  2388        3
3           0     0        5
4           0     0        3

No entanto, diversos algoritmos de ciência de dados
(especialmente algoritmos para cálculo de similaridade ou
distância entre objetos, como é o caso do k-nearest neighbors (k-NN)) requerem que todos os atributos
numéricos estejam na mesma escala para que possam funcionar
corretamente, ou seja, que estes atributos estejam normalizados
dentro de uma faixa de valores comum como [0.0, 1.0] ou
[-1, 1] . Isto deve ser feito para assegurar que os números
grandes não "dominem" os números pequenos durante a análise.

Considere, por exemplo, um DataFrame contendo dois
atributos X e Y , onde a unidade de medida de X é milhas
náuticas e a de Y centímetros. Neste caso, uma diferença de 1
unidade em X é equivalente a 160.964 unidades em Y ! Ao
aplicar uma fórmula para medir a distância entre os objetos do
DataFrame, o valor de Y acabaria sendo o único a contribuir no
valor computado.

#### MinMaxScaler

Existem diversas fórmulas que podem ser utilizadas para
mapear todos os valores de um atributo para a faixa [0.0, 1.0] . Uma das mais simples é apresentada a seguir. Ela pode ser
utilizada sobre qualquer atributo que armazene valores contínuos
positivos. A fórmula apresentada
retornará o valor normalizado de x , isto é o valor convertido para
um número localizado entre 0 e 1.

`valor_normalizado = (x-min(X))/(max(X)-min(X))`

Por exemplo, para um dataset onde os valores mínimo são o -10 e o máximo é 30, o valor 18.8 seria normalizado da seguinte forma:

    y = (x – min) / (max – min)
    y = (18.8 – (-10)) / (30 – (-10))
    y = 28.8 / 40
    y = 0.72

No exemplo a seguir, mostra-se uma aplicação prática da fórmula: ela é empregada para computar o valor normalizado do atributo `area` para todos os países presentes no dataframe.

In [118]:
area_max = max(df['area'])
area_min = min(df['area'])
df['area_norm'] = (df['area'] - area_min) / (area_max - area_min)
df

,name,landmass,zone,area,population,language,religion,bars,stripes,colours,red,green,blue,gold,white,black,orange,mainhue,circles,crosses,saltires,quarters,sunstars,crescent,triangle,icon,animate,text,topleft,botright,area_norm
0,Afghanistan,5,1,648,16,10,2,0,3,5,1,1,0,1,1,1,0,green,0,0,0,0,1,0,0,1,0,0,black,green,0.028926
1,Albania,3,1,29,3,6,6,0,0,3,1,0,0,1,0,1,0,red,0,0,0,0,1,0,0,0,1,0,red,red,0.001295
2,Algeria,4,1,2388,20,8,2,2,0,3,1,1,0,0,1,0,0,green,0,0,0,0,1,1,0,0,0,0,green,white,0.106598
3,American-Samoa,6,3,0,0,1,1,0,0,5,1,0,1,1,1,0,1,blue,0,0,0,0,0,0,1,1,1,0,blue,red,0.000000
4,Andorra,3,1,0,0,6,0,3,0,3,1,0,1,1,0,0,0,gold,0,0,0,0,0,0,0,0,0,0,blue,red,0.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
189,Western-Samoa,6,3,3,0,1,1,0,0,3,1,0,1,0,1,0,0,red,0,0,0,1,5,0,0,0,0,0,blue,red,0.000134
190,Yugoslavia,3,1,256,22,6,6,0,3,4,1,0,1,1,1,0,0,red,0,0,0,0,1,0,0,0,0,0,blue,red,0.011428
191,Zaire,4,2,905,28,10,5,0,0,4,1,1,0,1,0,0,1,green,1,0,0,0,0,0,0,1,1,0,green,green,0.040398
192,Zambia,4,2,753,6,10,5,3,0,4,1,1,0,0,0,1,1,green,0,0,0,0,0,0,0,0,1,0,green,brown,0.033613
193,Zimbabwe,4,2,391,8,10,5,0,7,5,1,1,0,1,1,1,0,green,0,0,0,0,1,0,1,1,1,0,green,green,0.017454

Uma alternativa ao código anterior passaria por definir a função `norm` e recorrer à função Apply.

In [119]:
def norm(x, area_min, area_max):
    return (x - area_min)/(area_max - area_min)

#determina de entre todos os registos os valores máximo e mínimo
area_max = max(df['area'])
area_min = min(df['area'])

df['area_norm'] = df['area'].apply(lambda x: norm(x, area_min, area_max))
df

,name,landmass,zone,area,population,language,religion,bars,stripes,colours,red,green,blue,gold,white,black,orange,mainhue,circles,crosses,saltires,quarters,sunstars,crescent,triangle,icon,animate,text,topleft,botright,area_norm
0,Afghanistan,5,1,648,16,10,2,0,3,5,1,1,0,1,1,1,0,green,0,0,0,0,1,0,0,1,0,0,black,green,0.028926
1,Albania,3,1,29,3,6,6,0,0,3,1,0,0,1,0,1,0,red,0,0,0,0,1,0,0,0,1,0,red,red,0.001295
2,Algeria,4,1,2388,20,8,2,2,0,3,1,1,0,0,1,0,0,green,0,0,0,0,1,1,0,0,0,0,green,white,0.106598
3,American-Samoa,6,3,0,0,1,1,0,0,5,1,0,1,1,1,0,1,blue,0,0,0,0,0,0,1,1,1,0,blue,red,0.000000
4,Andorra,3,1,0,0,6,0,3,0,3,1,0,1,1,0,0,0,gold,0,0,0,0,0,0,0,0,0,0,blue,red,0.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
189,Western-Samoa,6,3,3,0,1,1,0,0,3,1,0,1,0,1,0,0,red,0,0,0,1,5,0,0,0,0,0,blue,red,0.000134
190,Yugoslavia,3,1,256,22,6,6,0,3,4,1,0,1,1,1,0,0,red,0,0,0,0,1,0,0,0,0,0,blue,red,0.011428
191,Zaire,4,2,905,28,10,5,0,0,4,1,1,0,1,0,0,1,green,1,0,0,0,0,0,0,1,1,0,green,green,0.040398
192,Zambia,4,2,753,6,10,5,3,0,4,1,1,0,0,0,1,1,green,0,0,0,0,0,0,0,0,1,0,green,brown,0.033613
193,Zimbabwe,4,2,391,8,10,5,0,7,5,1,1,0,1,1,1,0,green,0,0,0,0,1,0,1,1,1,0,green,green,0.017454

Se não se sentir confortável com funções anónimas (lambda) pode optar por passar para a função `norm` os parâmetros `area_min` e `area_max`:

In [120]:
def norm(x, area_min, area_max):
    return (x - area_min)/(area_max - area_min)

#determina de entre todos os registos os valores máximo e mínimo
area_max = max(df['area'])
area_min = min(df['area'])

df['area_norm'] = df['area'].apply(norm, area_min=area_min, area_max=area_max)
df

,name,landmass,zone,area,population,language,religion,bars,stripes,colours,red,green,blue,gold,white,black,orange,mainhue,circles,crosses,saltires,quarters,sunstars,crescent,triangle,icon,animate,text,topleft,botright,area_norm
0,Afghanistan,5,1,648,16,10,2,0,3,5,1,1,0,1,1,1,0,green,0,0,0,0,1,0,0,1,0,0,black,green,0.028926
1,Albania,3,1,29,3,6,6,0,0,3,1,0,0,1,0,1,0,red,0,0,0,0,1,0,0,0,1,0,red,red,0.001295
2,Algeria,4,1,2388,20,8,2,2,0,3,1,1,0,0,1,0,0,green,0,0,0,0,1,1,0,0,0,0,green,white,0.106598
3,American-Samoa,6,3,0,0,1,1,0,0,5,1,0,1,1,1,0,1,blue,0,0,0,0,0,0,1,1,1,0,blue,red,0.000000
4,Andorra,3,1,0,0,6,0,3,0,3,1,0,1,1,0,0,0,gold,0,0,0,0,0,0,0,0,0,0,blue,red,0.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
189,Western-Samoa,6,3,3,0,1,1,0,0,3,1,0,1,0,1,0,0,red,0,0,0,1,5,0,0,0,0,0,blue,red,0.000134
190,Yugoslavia,3,1,256,22,6,6,0,3,4,1,0,1,1,1,0,0,red,0,0,0,0,1,0,0,0,0,0,blue,red,0.011428
191,Zaire,4,2,905,28,10,5,0,0,4,1,1,0,1,0,0,1,green,1,0,0,0,0,0,0,1,1,0,green,green,0.040398
192,Zambia,4,2,753,6,10,5,3,0,4,1,1,0,0,0,1,1,green,0,0,0,0,0,0,0,0,1,0,green,brown,0.033613
193,Zimbabwe,4,2,391,8,10,5,0,7,5,1,1,0,1,1,1,0,green,0,0,0,0,1,0,1,1,1,0,green,green,0.017454

<hr>

Uma outra alternativa passa por recorre ao sklearn e às suas funções de normalização. O código abaixo exemplifica a aplicação do método `MinMaxScaler`. Esta função obriga à passagem de um array com pelo menos uma coluna, algo que não está explicitamente definido em `df['area']` (como se pode observar). Por esse motivo aplicamos o código (`df['area'].values.reshape(-1, 1)`) para dessa forma definir explicitamente `x` linhas e `1` coluna.

In [121]:
df['area'].shape

(194,)

In [122]:
from sklearn.preprocessing import MinMaxScaler
MinMaxScaler().fit_transform(df['area'].values.reshape(-1, 1))

array([[2.89259888e-02],
       [1.29452727e-03],
       [1.06597625e-01],
       [0.00000000e+00],
       [0.00000000e+00],
       [5.56646728e-02],
       [0.00000000e+00],
       [0.00000000e+00],
       [1.23962146e-01],
       [1.23962146e-01],
       [3.43272922e-01],
       [3.74966521e-03],
       [8.48138559e-04],
       [4.46388715e-05],
       [6.38335863e-03],
       [0.00000000e+00],
       [1.38380502e-03],
       [1.02669405e-03],
       [5.04419248e-03],
       [0.00000000e+00],
       [2.09802696e-03],
       [4.90581198e-02],
       [2.67833229e-02],
       [3.79966074e-01],
       [0.00000000e+00],
       [2.67833229e-04],
       [4.95491474e-03],
       [1.22310508e-02],
       [3.02651549e-02],
       [1.24988840e-03],
       [2.11588251e-02],
       [4.45317382e-01],
       [1.78555486e-04],
       [0.00000000e+00],
       [2.78100170e-02],
       [5.73163110e-02],
       [3.37916257e-02],
       [4.26792251e-01],
       [5.08436747e-02],
       [8.92777431e-05],
       [1.52664941e-02],
       [0.00000000e+00],
       [2.27658245e-03],
       [5.13347023e-03],
       [4.01749844e-04],
       [5.71377556e-03],
       [1.91947148e-03],
       [9.82055174e-04],
       [0.00000000e+00],
       [2.18730470e-03],
       [1.26774395e-02],
       [4.46835104e-02],
       [9.37416302e-04],
       [1.24988840e-03],
       [5.45487010e-02],
       [4.46388715e-05],
       [5.35666458e-04],
       [8.03499688e-04],
       [1.50432997e-02],
       [2.44174627e-02],
       [4.06213731e-03],
       [1.78555486e-04],
       [1.19632176e-02],
       [4.46388715e-04],
       [4.82099813e-03],
       [1.11150790e-02],
       [1.06686903e-02],
       [0.00000000e+00],
       [5.89233104e-03],
       [9.71341844e-02],
       [0.00000000e+00],
       [0.00000000e+00],
       [4.86563700e-03],
       [1.09811624e-02],
       [1.60699938e-03],
       [9.59735738e-03],
       [1.24988840e-03],
       [4.99955361e-03],
       [4.46388715e-05],
       [4.15141505e-03],
       [4.59780377e-03],
       [1.45879832e-01],
       [8.49924114e-02],
       [7.35648603e-02],
       [1.94179091e-02],
       [3.12472101e-03],
       [9.37416302e-04],
       [1.34363003e-02],
       [1.44183555e-02],
       [4.91027587e-04],
       [1.66056602e-02],
       [4.37460941e-03],
       [8.07963575e-03],
       [2.60244621e-02],
       [0.00000000e+00],
       [8.03499688e-04],
       [1.05347737e-02],
       [4.46388715e-04],
       [1.33916615e-03],
       [4.95491474e-03],
       [7.85644139e-02],
       [0.00000000e+00],
       [1.33916615e-04],
       [2.62030176e-02],
       [5.26738684e-03],
       [1.48647442e-02],
       [0.00000000e+00],
       [5.53522007e-02],
       [0.00000000e+00],
       [0.00000000e+00],
       [4.60226765e-02],
       [8.92777431e-05],
       [8.80724935e-02],
       [4.46388715e-05],
       [0.00000000e+00],
       [6.99044728e-02],
       [0.00000000e+00],
       [1.99535756e-02],
       [3.49522364e-02],
       [0.00000000e+00],
       [6.24944201e-03],
       [1.83019373e-03],
       [0.00000000e+00],
       [1.19632176e-02],
       [5.71377556e-03],
       [5.65574502e-02],
       [4.12909562e-02],
       [0.00000000e+00],
       [5.40130346e-03],
       [8.70457995e-03],
       [1.44629944e-02],
       [9.46344076e-03],
       [3.58896527e-02],
       [3.39255424e-03],
       [2.06677975e-02],
       [1.81680207e-02],
       [5.73609499e-02],
       [1.33916615e-02],
       [1.39719668e-02],
       [4.10677618e-03],
       [4.01749844e-04],
       [4.91027587e-04],
       [1.05794126e-02],
       [1.16061066e-03],
       [0.00000000e+00],
       [0.00000000e+00],
       [9.59735738e-02],
       [8.74921882e-03],
       [0.00000000e+00],
       [3.21399875e-03],
       [4.46388715e-05],
       [1.33916615e-03],
       [2.84349612e-02],
       [5.45040621e-02],
       [4.41924828e-03],
       [1.28559950e-02],
       [2.25426301e-02],
       [2.94616552e-03],
       [0.00000000e+00],
       [0.00000000e+00],
       [0.00000000e+00],
       [0.00000000e+00],
       [1.11865012e-01],
       [2.81224891e-03],
       [7.58860816e-04],
       [2.00874922e-02],
       [1.83019373e-03],
       [8.25819123e-03],
       [1.60699938e-03],
       [4.21837336e-02],
       [2.29443800e-02],
       [2.54441568e-03],
       [4.46388715e-05],
       [2.23194358e-04],
       [7.32077493e-03],
       [3.48629587e-02],
       [0.00000000e+00],
       [0.00000000e+00],
       [3.74966521e-03],
       [1.05347737e-02],
       [1.09365235e-02],
       [7.94571913e-03],
       [0.00000000e+00],
       [4.17953754e-01],
       [1.00000000e+00],
       [6.69583073e-04],
       [0.00000000e+00],
       [4.07106508e-02],
       [1.48647442e-02],
       [1.33916615e-04],
       [1.14275511e-02],
       [4.03981787e-02],
       [3.36130703e-02],
       [1.74537988e-02]])

Os valores são devolvidos em notação científica. O `e` indica-nos para onde a casa decimal deve ser movida. Nos casos em que o `e` é seguido de `+` movemos o ponto decimal para a direita (tantas casas quantas as aí indicadas). Por exemplo `1.00e+00` é equivalente a 1; `2.89e+02` é equivalente a 289. Nos casos em que `e` é seguido de `-` movemos o ponto decimal para a esquerda (tantas casas quantas as aí indicadas). Por exemplo `2.89e-02` é equivalente a `0.0289`.

Tal como anteriormente também aqui podemos atribuir os valores a uma nova coluna do dataframe.

In [123]:
from sklearn.preprocessing import MinMaxScaler
df['area_norm'] = MinMaxScaler().fit_transform(df['area'].values.reshape(-1, 1))
df.head()

,name,landmass,zone,area,population,language,religion,bars,stripes,colours,red,green,blue,gold,white,black,orange,mainhue,circles,crosses,saltires,quarters,sunstars,crescent,triangle,icon,animate,text,topleft,botright,area_norm
0,Afghanistan,5,1,648,16,10,2,0,3,5,1,1,0,1,1,1,0,green,0,0,0,0,1,0,0,1,0,0,black,green,0.028926
1,Albania,3,1,29,3,6,6,0,0,3,1,0,0,1,0,1,0,red,0,0,0,0,1,0,0,0,1,0,red,red,0.001295
2,Algeria,4,1,2388,20,8,2,2,0,3,1,1,0,0,1,0,0,green,0,0,0,0,1,1,0,0,0,0,green,white,0.106598
3,American-Samoa,6,3,0,0,1,1,0,0,5,1,0,1,1,1,0,1,blue,0,0,0,0,0,0,1,1,1,0,blue,red,0.000000
4,Andorra,3,1,0,0,6,0,3,0,3,1,0,1,1,0,0,0,gold,0,0,0,0,0,0,0,0,0,0,blue,red,0.000000

#### StandardScaler

Standardizing a dataset involves rescaling the distribution of values so that the mean of observed values is 0 and the standard deviation is 1. This can be thought of as subtracting the mean value or centering the data. Subtracting the mean from the data is called centering, whereas dividing by the standard deviation is called scaling. As such, the method is sometime called “center scaling“.

`y = (x – mean) / standard_deviation`

Where the mean is calculated as:

`mean = sum(x) / count(x)`

And the standard_deviation is calculated as:

`standard_deviation = sqrt( sum( (x – mean)^2 ) / count(x))`

Por exemplo, para um dataset onde a média é 10 e o desvio padrão é 5, o valor 18.8 seria normalizado da seguinte forma:

    y = (x – mean) / standard_deviation
    y = (18.8 – 10) / 5
    y = (8.8) / 5
    y = 1.76

Use StandardScaler if you know the data distribution is normal.

If there are outliers, use RobustScaler(). Alternatively you could remove the outliers and use either of the above 2 scalers (choice depends on whether data is normally distributed)

In [ ]:
from sklearn.preprocessing import StandardScaler
df['area_norm'] = StandardScaler().fit_transform(df['area'].values.reshape(-1, 1))
df.head()

<hr>

### Feature Encoding

<img src="https://www.di.ubi.pt/~rcampos/assets/img_tutorials/DataScience/FeatureEncoding.jpg" width="600" height="600" align="center"/>

#### Discretization (Binning)

Discretization (aka binning) is a common data pre-processing technique used to group intervals of numerical data into “bins” or “buckets”.

No código abaixo exemplificamos o processo de discretização, onde valores numéricos são transformados num conjunto reduzido de valores categóricos. Para melhor exemplificar este processo comece por importar o ficheiro `flags.csv` para um dataframe.

In [ ]:
import pandas as pd
df = pd.read_csv('data/flags.csv')
df.head()

The main challenge in discretization is to choose the number of intervals or bins and how to decide on their width. There are several methods that you can use to discretize data.

##### Custom Function

Em processos de transformação de dados, é muito comum que
exista a necessidade de realizar o ajuste ou formatação dos dados de
uma coluna do DataFrame através da aplicação de uma função
Python sobre a coluna. Situações deste tipo podem ser
resolvidas de maneira extremamente simples com o uso do método
`apply()`, que permite que qualquer função do Python seja
aplicada de uma só vez sobre todos os valores de uma coluna.

Neste exercício pretendemos criar uma função que caracterize a dimensão da área (fornecida em milhares de quilômetros quadrados) em seis códigos possíveis.

| Código        | Tamanho da área         |
| ------------------------------ |:-------------|
| **A**      | mais de 1 000 000 km2    |
| **B** | de 500 000 km2 a 1 000 000 km2    |
| **C**      | de 100 000 km2 a 500 000 km2    |
| **D** | de 50 000 km2 a 99 000 km2    |
| **E**      | de 10 000 km2 a 50 000 km2    |
| **F** | menos de 10 000 km2    |

Com vista a esse objetivo definimos a seguinte função:

In [ ]:
def classe_area(area):
    if (area < 10) :
        return 'F'
    elif (area >= 10 and area < 50) :
        return 'E'
    elif (area >= 50 and area < 100) :
        return 'D'
    elif (area >= 100 and area < 500) :
        return 'C'
    elif (area >= 500 and area < 1000) :
        return 'B'
    else :
        return 'A'

Posteriormente recorremos ao método `apply` para criar um novo atributo `classe_area` que decorre da aplicação da função `classe_area` ao atributo `area`.

In [ ]:
df['classe_area'] = df['area'].apply(classe_area)
df[['name','area','classe_area']].head()

Uma alternativa à definiçao de uma função e ao uso do apply passa por recorrer à função `cut`. Tal como acima podemos recorrer
à especificação de intervalos:
- -float("inf") - 10: F
- 10 - 50: E
- 50 - 100: D
- 100 - 500: C
- 500 - 1000: B
- 1000 - float("inf"): A

In [ ]:
df['classe_area'] = pd.cut(df['area'], bins = [-float("inf"),10,50, 100, 500, 1000, float("inf")], labels=['F', 'E', 'D', 'C', 'B','A'])
df[['name','area','classe_area']].head()

##### Equal-Width

Uma alternativa à definiçao de uma função e ao uso do apply passa por recorrer à função `cut`. No caso o sistema define 6 bins equidistantes.

In [ ]:
df['classe_area'], cut_bin = pd.cut(df['area'], bins = 6, labels=['F', 'E', 'D', 'C', 'B', 'A'], retbins = True)
df[['name','area','classe_area']].head()

The first thing you’ll notice is that the bin ranges are all about 3,734

In [ ]:
cut_bin

but that the distribution of bin elements is not equal.

In [ ]:
df['classe_area'].value_counts()

##### Equal-Frequency

Rather than simply passing in a number of groupings you want to create, you can also pass in a list of quartiles you want to create. This list should be a range from 0 through 1, splitting the data into equal percentages. The major distinction is that qcut will calculate the size of each bin in order to make sure the distribution of data in the bins is equal. In other words, all bins will have (roughly) the same number of observations but the bin range will vary. Let’ see how we can split our data into 25% bins (which means using q = 5 or q = [0, 0.25, 0.5, 0.75, 1])

In [ ]:
df['classe_area'], cut_bin = pd.qcut(df['area'], q=5, labels=['E', 'D', 'C', 'B','A'], retbins = True)
df[['name','area','classe_area']].head()

The below code shows that we have the approximate number of records in each of the 5 bins.

In [ ]:
df['classe_area'].value_counts()

However, the bins are not equally-sized

In [ ]:
cut_bin

- Quantile 0: 0 (min number)
- Quantile 0.25: 1
- Quantile 0.50: 47.40
- Quantile 0.75: 231.80
- Quantile 1: 660.00 (max number)

Having q = 6 in this case, will generate an error as the system generates duplicate values in the arrays (in the case, it generates two zeros).

In [ ]:
df['classe_area'], cut_bin = pd.qcut(df['area'], q=6, labels=['F', 'E', 'D', 'C', 'B','A'], retbins = True)
df[['name','area','classe_area']].head()

<hr>

#### Categorical Data Encoding

This part of the notebook is based on: https://github.com/atulpatelDS/Youtube/blob/main/Feature_Engineering/Categorical%20Features%20Encoding%20Ordinal%20Encoding%20Label%20Encoding%20OnehotEncoding%20-%20Feature%20Transformation%20Tutorial%204%20%2C5%20%2C6.ipynb

Most Machine Learning Algorithms cannot work with categorical variables directly, they need to be converted to numbers. Even if we find a way to directly work with categorical variables without converting them to numbers, our model shall get biased towards the language we use. For eg, in an animal classification task, if the labels are {‘rat’, ‘dog’, ‘ant’}, then using such a labelling method would train our model to predict labels only in English, which would put a linguistic restriction upon the possible applications of the model.

So most machine learning models only accept numerical variables, preprocessing the categorical variables becomes a necessary step. We need to convert these categorical variables to numbers so that the model is able to understand and extract valuable information.

<img src="https://www.di.ubi.pt/~rcampos/assets/img_tutorials/DataScience/Categorical.jpg" width="600" height="600" align="center"/>

<center>Source: https://towardsdatascience.com/all-about-categorical-variable-encoding-305f3361fd02</center>

Unfortunately, there is no single answer on how to approach this problem. Each approach has trade-offs and has potential impact on the outcome of the analysis. Fortunately, the python tools of **pandas** and **scikit-learn** provide several approaches that can be applied to transform the categorical data into suitable numeric values.

Before we start, let us recap what we have learned before. Give us three examples of categorical variables (both nominal and ordinal):

In [ ]:
#type here your answer

Click <b>here</b> twice to see the solution.

<!--
Categóricas nominais:
- Red, Yellow, Pink, Blue
- Singapore, Japan, USA, India, Korea
- Cow, Dog, Cat, Snake

Categóricas Ordinais
- High, Medium, Low
- “Strongly agree,” Agree, Neutral, Disagree, and “Strongly Disagree.”
- Excellent, Okay, Bad
-->

##### Load Dataset

To start with, we begin by loading a dataset named `feature_encoding`. As this dataset is going to be used a few times we defined a function named `load_dataset()` to be called whenever needed.

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
    
def load_dataset():
    #df = pd.read_excel("https://raw.githubusercontent.com/atulpatelDS/Data_Files/master/Feature_Engineering/feature_encoding.xlsx")
    df = pd.read_excel("data/feature_encoding.xlsx")
    df.drop("CUSTID",axis=1,inplace=True)
    return df

Next, we call the function:

In [ ]:
df = load_dataset()
df

And get some info about the dataset.

In [ ]:
df.info()

##### Find and Replace

Before we go into some of the more “standard” approaches for encoding categorical data, this data set highlights one potential approach I’m calling “find and replace.” In the following, we replace two cardinal binary features (`PAYMENT_MODE_CARD` with `N` and `Y`; and `CUSTOMER_TYPE` with `Premium` and `NonPremium`) by 1 and 0.

To this regard we can use `apply` as below:

```
df["PAYMENT_MODE_CARD"] = df["PAYMENT_MODE_CARD"].apply(lambda x : 1 if x =='Y' else (0 if x == 'N' else None))
df["CUSTOMER_TYPE"] = df["CUSTOMER_TYPE"].apply(lambda x : 1 if x == "Premium" else (0 if x == "NonPremium" else None))
```

or the `replace` method:

In [ ]:
dict_map = {"PAYMENT_MODE_CARD": {"Y": 1, "N": 2},
             "CUSTOMER_TYPE": {"Premium": 1, "NonPremium": 0}}

df = df.replace(dict_map)

df[['PAYMENT_MODE_CARD',"CUSTOMER_TYPE"]].head()

##### Ordinal Features

We use this categorical data encoding technique when the categorical feature is ordinal. In this case, retaining the order is important. Hence encoding should reflect the sequence. In encoding, each label is converted into an integer value.

###### Ordinal Encoding

Ordinal encoding can be applied to one just single feature or to multiple features of the table.

<u>**One Single Feature**</u>

In this technique, each label is assigned a unique integer based on alphabetical ordering.

In [ ]:
df = load_dataset()
df['RATING'].unique()

One way to circumvent this problem is to explicitly define the categories when calling the OrdinalEncoder. To this regard we can make use of pandas:

In [ ]:
dict_rating = {'extremely dislike': 0, 'dislike': 1, 'neutral': 2, 'like':3, 'extremely like': 4}
df['RATING'] = df['RATING'].map(dict_rating)
df.head(10)

Alternatively we can make use  of sklearn. To this, we resort to the categories attribute to define the rating.

In [ ]:
from sklearn.preprocessing import OrdinalEncoder

df = load_dataset()

encoder = OrdinalEncoder(categories=[["extremely dislike","dislike", "neutral", "like", "extremely like"]])
df['RATING'] = encoder.fit_transform(df['RATING'].values.reshape(-1,1)) #Expected 2D array, got 1D array instead
#encoder.fit_transform(df_train['RATING'])
df.head(10)

The following shows the categories, which are encoded with values in-between 0 and 4.

In [ ]:
encoder.categories_

Next we show how this process can be done to multiple features.

<u>**Multiple Features**</u>

We begin by re-loading the dataset through the `load_dataset()` function which was defined before in this notebook.

In [ ]:
df = load_dataset()

In this case we are going to encode the `RATING` and the `EDUCATION` features.

In [ ]:
print(df['RATING'].unique())
print(df['EDUCATION'].unique())

Next, we specify the categories of both `RATING` and `EDUCATION` and `fit_transform` both features.

In [ ]:
from sklearn.preprocessing import OrdinalEncoder

encoder = OrdinalEncoder(categories=[["extremely dislike","dislike", "neutral", "like", "extremely like"],["phd","ms", "bs"]])
df[['RATING','EDUCATION']] = encoder.fit_transform(df[['RATING','EDUCATION']])
df.head(5)

<hr>

###### Label Encoding

Label enconding is again to be used with ordinal features. It has the advantage that it is straightforward but it has the disadvantage that the numeric values can be “misinterpreted” by the algorithms. For example, the value of 0 is obviously less than the value of 4 but does that really correspond to the data set in real life? Does a wagon have “4X” more weight in our calculation than the convertible? I don't think so. For that reason Label encoding should only used to target variables.

Label coding would not consider whether the variable is ordinal or not, and it will assign a sequence of integers (still this could be understood as having some order, which may not be the case, and for that reason, Label encoding can only by used for target variables).

 **While OrdinalEncoder is for converting features, LabelEncoder is for converting target variable**.

Other important differences from **OrdinalEncoder** vs **LabelEncoder**:

- OrdinalEncoder for 2D data; shape (n_samples, n_features), LabelEncoder is for 1D data: for shape (n_samples,))
- Another difference between the encoders is the name of their learned parameter: LabelEncoder learns `classes_`   ; OrdinalEncoder learns `categories_`

We begin, once again by loading the dataset:

In [ ]:
df = load_dataset()
df.head()

To perform label encoding in pandas we can resort to `pd.factorize` function which requires a series object (the reason for us to use [0]; then reshape will define multiple rows (-1) with 1 column). Compared to the find and replace approach, here, the numbers for the categories `CUSTOMER_TYPE` are automatically assigned without any specific meaning. Indeed it uses the order of data appearing in the dataframe. Thus we will have: 
- Premium --> 0
- NonPremium --> 1

One major issue with this approach is there is no relation or order between these classes, but the algorithm might consider them as some order or some relationship (e.g., premium < nonpremium). **Thus, label encoders should only be used to encode the target values not the feature values**. For feature values we should use **ordinal encoding** if the order has some meaning or **one hot encoding** as we will see next.

In [ ]:
df["CUSTOMER_TYPE"] = pd.factorize(df['CUSTOMER_TYPE'])[0].reshape(-1,1)
df.head()

In addition to the pandas approach, scikit-learn provides similar functionality. Personally, I find using pandas a little simpler to understand but the scikit approach is optimal when you are trying to build a predictive model.

Instead of pandas, however, sklearn will not use the order of the data appearing in th dataframe but instead the alphabetical sorted order:
- NonPremium --> 0
- Premium --> 1

In [ ]:
from sklearn.preprocessing import LabelEncoder

encoder = LabelEncoder()
df['CUSTOMER_TYPE'] = encoder.fit_transform(df["CUSTOMER_TYPE"])
df.head(10)

<hr>

##### Nominal Features

###### One Hot Encoding

If we have the Nominal Dataset and If we perform the LabelEncoding, it encode the values on the basis of their alphabetical order. For instance, for the animal classification task the label variable, which is a nominal categorical variable can be encoded as: {‘rat’: 1, ‘dog’: 2, ‘ant’: 3}.

There is one major issue with this - the labels in the animal classification problem should not be encoded to integers (like we have done above) since that would enforce an apparently incorrect natural ordering of: ‘rat’ < ‘dog’ < ‘ant’. While we understand no such ordering really exists and that the numbers 1, 2 and 3 do not hold any numerical ordering in the labels we have encoded, our Machine Learning model will not be able to intuitively understand that.

If we feed these numbers directly into a model, the cost/loss function is likely to get affected by these values. Indeed, there is a very high probability that the model captures the relationship between the values while training and this will misleading to nominal features present in the data. This is something that we do not want!

So how can we overcome this obstacle? Here comes the concept of One-Hot Encoding:

- Every unique value in the category will be added as a feature and represented as a one-hot vector.
- Each category is mapped with a binary variable containing either 0 or 1. Here, 0 represents the absence, and 1 represents the presence of that category.
- These newly created binary features are known as Dummy variables.
- The number of columns depends on the number of categories for features. This has the benefit of not weighting a value improperly but does have the downside of adding more columns to the data set which may slow down the learning significantly if the number of the category is very high for the feature.

So lets understand how we can encode the one-hot encoding on the `CITY` feature.

In [ ]:
df = load_dataset()
df.head()

Pandas supports this feature using `get_dummies`. Note that the column `CITY` is automatically deleted once the new columns are generated.

In [ ]:
pd.get_dummies(df, columns=["CITY"]).head()

It can also be applied to more than one column and enables one to specify a prefix for the newly generated columns. In the following we apply it to the `CITY` and the `PAYMENT_MODE_CARD` features adding the prefix `PAYMENT` for the newly generated columns.

In [ ]:
df = load_dataset()
df = pd.get_dummies(df, prefix = ['CITY', 'PAYMENT'], columns= ['CITY', 'PAYMENT_MODE_CARD'])
df.head()

Scikit-learn also supports binary encoding by using the OneHotEncoder. We use a similar process as above to transform the data but the process of creating a pandas DataFrame adds a couple of extra steps.

In [ ]:
from sklearn.preprocessing import OneHotEncoder

df = load_dataset()

encoder = OneHotEncoder()
hot = encoder.fit_transform(df[["CITY"]])
pd.DataFrame(hot.toarray(), columns=["CITY_" + name for name in encoder.categories_])

The following example shows how to encode the variable and at the same time join the encoding result with the dataframe. Here is an example:

In [ ]:
from sklearn.preprocessing import OneHotEncoder

encoder = OneHotEncoder()
hot = encoder.fit_transform(df[["CITY"]])
df = df.join(pd.DataFrame(hot.toarray(), columns=["CITY_" + name for name in encoder.categories_]))
df.head()

However, it may probably make more sense to have indexes as names of the newly generated columns:

In [ ]:
from sklearn.preprocessing import OneHotEncoder

df = load_dataset()

encoder = OneHotEncoder()
hot = encoder.fit_transform(df[["CITY"]])
df = df.join(pd.DataFrame(hot.toarray(), columns=["CITY_" + str(i) for i in range(len(df['CITY'].unique()))]))
df.head()

Also, don't forget to delete the `CITY` column feature:

In [ ]:
df.drop("CITY",inplace=True,axis=1) #droping the "CITY" column 
df.head()

The following shows how to do this process to more than one feature.

In [ ]:
from sklearn.preprocessing import OneHotEncoder

df = load_dataset()

encoder = OneHotEncoder()
hot = encoder.fit_transform(df[["CITY","PAYMENT_MODE_CARD"]])
#encoder.categories_
df = df.join(pd.DataFrame(hot.toarray(), columns=["CITY_" + name for name in encoder.categories_[0]] + ["PAYMENT_" + name for name in encoder.categories_[1]]))
df.head()

Note that the parameter `drop='if_binary'` can be used in the `OneHotEnconder` (e.g., `OneHotEncoder(drop='if_binary')`) whenever we want to discard the creation of two columns (when in the presence of binary features). For instance, in machine learning models it doesn't make sense to have both `PAYMENT_N` and `PAYMENT_Y`.

<u>**Drawbacks of One-Hot and Dummy Encoding**</u>

- if there are multiple categories in a feature variable in such a case we need a similar number of dummy variables to encode the data. For example, a column with 100 different values will require 100 new variables for coding.
- If we have multiple categorical features in the dataset ,again we will end to have several binary features each representing the categorical feature and their multiple categories.
- In both the above cases, these two encoding schemes introduce sparsity in the dataset i.e several columns having 0s and a few of them having 1s. In other words, it creates multiple dummy features in the dataset without adding much information.
- Due to the massive increase in the dataset, coding slows down the learning of the model along with deteriorating the overall performance that ultimately makes the model computationally expensive.
- Further, while using tree-based models these encodings are not an optimum choice.

##### Wrap-up

We apply one hot encoding when:
- The categorical feature is not ordinal (e.g., CITY names)
- The number of categorical feature instances is reduced such that one-hot encoding can be applied efficiently.

We apply labeling enconding and ordinal encoding when:
- the categorical feature is ordinal (e.g., primary school, high school)
- the number of categories is quite large (and one-hot encoding cannot be applied due to memory consumption)

You use ordinal encoding to preserve order of categorical data i.e. `cold, warm, hot; low, medium, high`. You use label encoding or one hot for categorical data, where there's no order in data i.e. `dog, cat, whale`.

Note however that LabelEncoding assumes an order (the same way Ordinal does). Thus LabelEncoding should also be used on top of the target variables. Running it over feature variable may be risky as some algorithms may take into account its alleged ranking order.

- target variables: LabelEncoding (nominal)
- feature variables: OneHotEncoding (nominal) or OrdinalEncoding (ordinal).

Other differences:

- OrdinalEncoder for 2D data; shape (n_samples, n_features), LabelEncoder is for 1D data: for shape (n_samples,))
- Another difference between the encoders is the name of their learned parameter: LabelEncoder learns `classes_`   ; OrdinalEncoder learns `categories_`

<u>**sklearn.preprocessing.OneHotEncoder instead of pd.get_dummies**</u>

- This is because sklearn.preprocessing.OneHotEncoder returns an object of sklearn.preprocessing.OneHotEncoder class. We can fit this object on the training set and then use the same object to transform the test set.
- On the other hand, pd.get_dummies returns a dataframe with encodings based on the values in the dataframe we pass to it. This might be good for a quick analysis, but for an extended model building project where you train on training set and will be later testing on a test set, I would suggest using sklearn.preprocessing.OneHotEncoder.

##### Advanced Approaches

There are even more advanced algorithms for categorical encoding. A description of some of those advanced approaches can be seen here: https://towardsdatascience.com/all-about-categorical-variable-encoding-305f3361fd02 and here: https://pbpython.com/categorical-encoding.html

A python package to play with these advanced approaches can ge found here: https://github.com/scikit-learn-contrib/category_encoders

##### scikit-learn pipelines

As mentioned above, scikit-learn’s categorical encoders allow you to incorporate the transformation into your pipelines which can simplify the model building process and avoid some pitfalls. I recommend this Data School video as a good intro.

In [ ]:
from IPython.display import HTML
HTML('<div align="center"><iframe width="560" height="315" src="https://www.youtube.com/embed/irHhDMbw3xo" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe></div>')

So we begin again by importing our dataset:

In [ ]:
import pandas as pd
import numpy as np

# Define the headers since the data does not have any
headers = ["symboling", "normalized_losses", "make", "fuel_type", "aspiration",
           "num_doors", "body_style", "drive_wheels", "engine_location",
           "wheel_base", "length", "width", "height", "curb_weight",
           "engine_type", "num_cylinders", "engine_size", "fuel_system",
           "bore", "stroke", "compression_ratio", "horsepower", "peak_rpm",
           "city_mpg", "highway_mpg", "price"]

# Read in the CSV file and convert "?" to NaN
df = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/autos/imports-85.data",
                  header=None, names=headers, na_values="?" )
df.head()

In this example we are going to try to predict the `price` based on a number of features `fuel_type`, `make`, `aspiration`, `highway_mpg`, `city_mpg`, `curb_weight`, `drive_wheels`

The following code show us that the target column `price` has some `NaN` values.

In [ ]:
df.columns[df.isnull().any()]

So a good starting point is to remove NaN values on the price column:

In [ ]:
# Remove the empty price rows
df = df.dropna(subset=['price'])

Next we define the features columns and the target

In [ ]:
# for the purposes of this analysis, only use a small subset of features

feature_cols = [
    'fuel_type', 'make', 'aspiration', 'highway_mpg', 'city_mpg',
    'curb_weight', 'drive_wheels'
]

X = df[feature_cols]
y = df['price']

In [ ]:
X.head()

Now that we have our data, let’s build the column transformer. This example shows how to apply different encoder types for certain columns. Using the remainder='passthrough' argument to pass all the numeric values through the pipeline without any changes.

In [ ]:
from sklearn.compose import make_column_transformer

from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import OrdinalEncoder

column_trans = make_column_transformer((OneHotEncoder(handle_unknown='ignore'),
                                        ['fuel_type', 'make', 'drive_wheels']),
                                      (OrdinalEncoder(), ['aspiration']),
                                      remainder='passthrough')

For the model, we use a simple linear regression and then make the pipeline (which takes the data that we pass to it; it transforms the columns (pre-processing steps); builds the model):

In [ ]:
from sklearn.linear_model import LinearRegression
from sklearn.pipeline import make_pipeline

pipe = make_pipeline(column_trans, LinearRegression())

Run the cross validation 10 times using the negative mean absolute error as our scoring function. Finally, take the average of the 10 values to see the magnitude of the error:

In [ ]:
from sklearn.model_selection import cross_val_score
cross_val_score(pipe, X, y, cv=5, scoring='neg_mean_absolute_error').mean().round(2)

Another example, this time for the Titanic dataset and for the above video can be seen here: https://github.com/justmarkham/scikit-learn-videos/blob/master/10_categorical_features.ipynb

`Pipelines` are a convenient and intuitive way to structure our ML flows, which are characterized by a predictable sequence of core tasks including preprocessing, feature selection, standardization/normalization, and classification.

## Bibliography

- https://towardsdatascience.com/7-must-know-data-wrangling-operations-with-python-pandas-849438a90d15
- https://towardsdatascience.com/all-about-categorical-variable-encoding-305f3361fd02
- https://pbpython.com/categorical-encoding.html